konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/sio.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
#  =============================================================================
#  Register block : SIO
#  Version        : 1
#  Bus type       : apb
#  Description    : Single-cycle IO block
#                   Provides core-local and inter-core hardware for the two
#                   processors, with single-cycle access.
#  =============================================================================
.ifndef	_HARDWARE_REGS_SIO_H
.set	_HARDWARE_REGS_SIO_H, 1
#  =============================================================================
#  Register    : SIO_CPUID
#  Description : Processor core identifier
#                Value is 0 when read from processor core 0, and 1 when read
#                from processor core 1.
.equ	SIO_CPUID_OFFSET, 0x00000000
.equ	SIO_CPUID_BITS, 0xffffffff
.equ	SIO_CPUID_MSB, 31
.equ	SIO_CPUID_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_IN
#  Description : Input value for GPIO0...31.
# 
#                In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL)
#                appear as zero.
.equ	SIO_GPIO_IN_OFFSET, 0x00000004
.equ	SIO_GPIO_IN_BITS, 0xffffffff
.equ	SIO_GPIO_IN_RESET, 0x00000000
.equ	SIO_GPIO_IN_MSB, 31
.equ	SIO_GPIO_IN_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_HI_IN
#  Description : Input value on GPIO32...47, QSPI IOs and USB pins
# 
#                In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL)
#                appear as zero.
.equ	SIO_GPIO_HI_IN_OFFSET, 0x00000008
.equ	SIO_GPIO_HI_IN_BITS, 0xff00ffff
.equ	SIO_GPIO_HI_IN_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_IN_QSPI_SD
#  Description : Input value on QSPI SD0 (MOSI), SD1 (MISO), SD2 and SD3 pins
.equ	SIO_GPIO_HI_IN_QSPI_SD_RESET, 0x0
.equ	SIO_GPIO_HI_IN_QSPI_SD_BITS, 0xf0000000
.equ	SIO_GPIO_HI_IN_QSPI_SD_MSB, 31
.equ	SIO_GPIO_HI_IN_QSPI_SD_LSB, 28
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_IN_QSPI_CSN
#  Description : Input value on QSPI CSn pin
.equ	SIO_GPIO_HI_IN_QSPI_CSN_RESET, 0x0
.equ	SIO_GPIO_HI_IN_QSPI_CSN_BITS, 0x08000000
.equ	SIO_GPIO_HI_IN_QSPI_CSN_MSB, 27
.equ	SIO_GPIO_HI_IN_QSPI_CSN_LSB, 27
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_IN_QSPI_SCK
#  Description : Input value on QSPI SCK pin
.equ	SIO_GPIO_HI_IN_QSPI_SCK_RESET, 0x0
.equ	SIO_GPIO_HI_IN_QSPI_SCK_BITS, 0x04000000
.equ	SIO_GPIO_HI_IN_QSPI_SCK_MSB, 26
.equ	SIO_GPIO_HI_IN_QSPI_SCK_LSB, 26
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_IN_USB_DM
#  Description : Input value on USB D- pin
.equ	SIO_GPIO_HI_IN_USB_DM_RESET, 0x0
.equ	SIO_GPIO_HI_IN_USB_DM_BITS, 0x02000000
.equ	SIO_GPIO_HI_IN_USB_DM_MSB, 25
.equ	SIO_GPIO_HI_IN_USB_DM_LSB, 25
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_IN_USB_DP
#  Description : Input value on USB D+ pin
.equ	SIO_GPIO_HI_IN_USB_DP_RESET, 0x0
.equ	SIO_GPIO_HI_IN_USB_DP_BITS, 0x01000000
.equ	SIO_GPIO_HI_IN_USB_DP_MSB, 24
.equ	SIO_GPIO_HI_IN_USB_DP_LSB, 24
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_IN_GPIO
#  Description : Input value on GPIO32...47
.equ	SIO_GPIO_HI_IN_GPIO_RESET, 0x0000
.equ	SIO_GPIO_HI_IN_GPIO_BITS, 0x0000ffff
.equ	SIO_GPIO_HI_IN_GPIO_MSB, 15
.equ	SIO_GPIO_HI_IN_GPIO_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_OUT
#  Description : GPIO0...31 output value
#                Set output level (1/0 -> high/low) for GPIO0...31. Reading back
#                gives the last value written, NOT the input value from the
#                pins.
# 
#                If core 0 and core 1 both write to GPIO_OUT simultaneously (or
#                to a SET/CLR/XOR alias), the result is as though the write from
#                core 0 took place first, and the write from core 1 was then
#                applied to that intermediate result.
# 
#                In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL)
#                ignore writes, and their output status reads back as zero. This
#                is also true for SET/CLR/XOR aliases of this register.
.equ	SIO_GPIO_OUT_OFFSET, 0x00000010
.equ	SIO_GPIO_OUT_BITS, 0xffffffff
.equ	SIO_GPIO_OUT_RESET, 0x00000000
.equ	SIO_GPIO_OUT_MSB, 31
.equ	SIO_GPIO_OUT_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_HI_OUT
#  Description : Output value for GPIO32...47, QSPI IOs and USB pins.
# 
#                Write to set output level (1/0 -> high/low). Reading back gives
#                the last value written, NOT the input value from the pins. If
#                core 0 and core 1 both write to GPIO_HI_OUT simultaneously (or
#                to a SET/CLR/XOR alias), the result is as though the write from
#                core 0 took place first, and the write from core 1 was then
#                applied to that intermediate result.
# 
#                In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL)
#                ignore writes, and their output status reads back as zero. This
#                is also true for SET/CLR/XOR aliases of this register.
.equ	SIO_GPIO_HI_OUT_OFFSET, 0x00000014
.equ	SIO_GPIO_HI_OUT_BITS, 0xff00ffff
.equ	SIO_GPIO_HI_OUT_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_QSPI_SD
#  Description : Output value for QSPI SD0 (MOSI), SD1 (MISO), SD2 and SD3 pins
.equ	SIO_GPIO_HI_OUT_QSPI_SD_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_QSPI_SD_BITS, 0xf0000000
.equ	SIO_GPIO_HI_OUT_QSPI_SD_MSB, 31
.equ	SIO_GPIO_HI_OUT_QSPI_SD_LSB, 28
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_QSPI_CSN
#  Description : Output value for QSPI CSn pin
.equ	SIO_GPIO_HI_OUT_QSPI_CSN_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_QSPI_CSN_BITS, 0x08000000
.equ	SIO_GPIO_HI_OUT_QSPI_CSN_MSB, 27
.equ	SIO_GPIO_HI_OUT_QSPI_CSN_LSB, 27
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_QSPI_SCK
#  Description : Output value for QSPI SCK pin
.equ	SIO_GPIO_HI_OUT_QSPI_SCK_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_QSPI_SCK_BITS, 0x04000000
.equ	SIO_GPIO_HI_OUT_QSPI_SCK_MSB, 26
.equ	SIO_GPIO_HI_OUT_QSPI_SCK_LSB, 26
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_USB_DM
#  Description : Output value for USB D- pin
.equ	SIO_GPIO_HI_OUT_USB_DM_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_USB_DM_BITS, 0x02000000
.equ	SIO_GPIO_HI_OUT_USB_DM_MSB, 25
.equ	SIO_GPIO_HI_OUT_USB_DM_LSB, 25
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_USB_DP
#  Description : Output value for USB D+ pin
.equ	SIO_GPIO_HI_OUT_USB_DP_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_USB_DP_BITS, 0x01000000
.equ	SIO_GPIO_HI_OUT_USB_DP_MSB, 24
.equ	SIO_GPIO_HI_OUT_USB_DP_LSB, 24
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_GPIO
#  Description : Output value for GPIO32...47
.equ	SIO_GPIO_HI_OUT_GPIO_RESET, 0x0000
.equ	SIO_GPIO_HI_OUT_GPIO_BITS, 0x0000ffff
.equ	SIO_GPIO_HI_OUT_GPIO_MSB, 15
.equ	SIO_GPIO_HI_OUT_GPIO_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_OUT_SET
#  Description : GPIO0...31 output value set
#                Perform an atomic bit-set on GPIO_OUT, i.e. `GPIO_OUT |= wdata`
.equ	SIO_GPIO_OUT_SET_OFFSET, 0x00000018
.equ	SIO_GPIO_OUT_SET_BITS, 0xffffffff
.equ	SIO_GPIO_OUT_SET_RESET, 0x00000000
.equ	SIO_GPIO_OUT_SET_MSB, 31
.equ	SIO_GPIO_OUT_SET_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_HI_OUT_SET
#  Description : Output value set for GPIO32..47, QSPI IOs and USB pins.
#                Perform an atomic bit-set on GPIO_HI_OUT, i.e. `GPIO_HI_OUT |=
#                wdata`
.equ	SIO_GPIO_HI_OUT_SET_OFFSET, 0x0000001c
.equ	SIO_GPIO_HI_OUT_SET_BITS, 0xff00ffff
.equ	SIO_GPIO_HI_OUT_SET_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_SET_QSPI_SD
.equ	SIO_GPIO_HI_OUT_SET_QSPI_SD_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_SET_QSPI_SD_BITS, 0xf0000000
.equ	SIO_GPIO_HI_OUT_SET_QSPI_SD_MSB, 31
.equ	SIO_GPIO_HI_OUT_SET_QSPI_SD_LSB, 28
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_SET_QSPI_CSN
.equ	SIO_GPIO_HI_OUT_SET_QSPI_CSN_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_SET_QSPI_CSN_BITS, 0x08000000
.equ	SIO_GPIO_HI_OUT_SET_QSPI_CSN_MSB, 27
.equ	SIO_GPIO_HI_OUT_SET_QSPI_CSN_LSB, 27
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_SET_QSPI_SCK
.equ	SIO_GPIO_HI_OUT_SET_QSPI_SCK_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_SET_QSPI_SCK_BITS, 0x04000000
.equ	SIO_GPIO_HI_OUT_SET_QSPI_SCK_MSB, 26
.equ	SIO_GPIO_HI_OUT_SET_QSPI_SCK_LSB, 26
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_SET_USB_DM
.equ	SIO_GPIO_HI_OUT_SET_USB_DM_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_SET_USB_DM_BITS, 0x02000000
.equ	SIO_GPIO_HI_OUT_SET_USB_DM_MSB, 25
.equ	SIO_GPIO_HI_OUT_SET_USB_DM_LSB, 25
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_SET_USB_DP
.equ	SIO_GPIO_HI_OUT_SET_USB_DP_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_SET_USB_DP_BITS, 0x01000000
.equ	SIO_GPIO_HI_OUT_SET_USB_DP_MSB, 24
.equ	SIO_GPIO_HI_OUT_SET_USB_DP_LSB, 24
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_SET_GPIO
.equ	SIO_GPIO_HI_OUT_SET_GPIO_RESET, 0x0000
.equ	SIO_GPIO_HI_OUT_SET_GPIO_BITS, 0x0000ffff
.equ	SIO_GPIO_HI_OUT_SET_GPIO_MSB, 15
.equ	SIO_GPIO_HI_OUT_SET_GPIO_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_OUT_CLR
#  Description : GPIO0...31 output value clear
#                Perform an atomic bit-clear on GPIO_OUT, i.e. `GPIO_OUT &=
#                ~wdata`
.equ	SIO_GPIO_OUT_CLR_OFFSET, 0x00000020
.equ	SIO_GPIO_OUT_CLR_BITS, 0xffffffff
.equ	SIO_GPIO_OUT_CLR_RESET, 0x00000000
.equ	SIO_GPIO_OUT_CLR_MSB, 31
.equ	SIO_GPIO_OUT_CLR_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_HI_OUT_CLR
#  Description : Output value clear for GPIO32..47, QSPI IOs and USB pins.
#                Perform an atomic bit-clear on GPIO_HI_OUT, i.e. `GPIO_HI_OUT
#                &= ~wdata`
.equ	SIO_GPIO_HI_OUT_CLR_OFFSET, 0x00000024
.equ	SIO_GPIO_HI_OUT_CLR_BITS, 0xff00ffff
.equ	SIO_GPIO_HI_OUT_CLR_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_CLR_QSPI_SD
.equ	SIO_GPIO_HI_OUT_CLR_QSPI_SD_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_CLR_QSPI_SD_BITS, 0xf0000000
.equ	SIO_GPIO_HI_OUT_CLR_QSPI_SD_MSB, 31
.equ	SIO_GPIO_HI_OUT_CLR_QSPI_SD_LSB, 28
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_CLR_QSPI_CSN
.equ	SIO_GPIO_HI_OUT_CLR_QSPI_CSN_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_CLR_QSPI_CSN_BITS, 0x08000000
.equ	SIO_GPIO_HI_OUT_CLR_QSPI_CSN_MSB, 27
.equ	SIO_GPIO_HI_OUT_CLR_QSPI_CSN_LSB, 27
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_CLR_QSPI_SCK
.equ	SIO_GPIO_HI_OUT_CLR_QSPI_SCK_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_CLR_QSPI_SCK_BITS, 0x04000000
.equ	SIO_GPIO_HI_OUT_CLR_QSPI_SCK_MSB, 26
.equ	SIO_GPIO_HI_OUT_CLR_QSPI_SCK_LSB, 26
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_CLR_USB_DM
.equ	SIO_GPIO_HI_OUT_CLR_USB_DM_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_CLR_USB_DM_BITS, 0x02000000
.equ	SIO_GPIO_HI_OUT_CLR_USB_DM_MSB, 25
.equ	SIO_GPIO_HI_OUT_CLR_USB_DM_LSB, 25
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_CLR_USB_DP
.equ	SIO_GPIO_HI_OUT_CLR_USB_DP_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_CLR_USB_DP_BITS, 0x01000000
.equ	SIO_GPIO_HI_OUT_CLR_USB_DP_MSB, 24
.equ	SIO_GPIO_HI_OUT_CLR_USB_DP_LSB, 24
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_CLR_GPIO
.equ	SIO_GPIO_HI_OUT_CLR_GPIO_RESET, 0x0000
.equ	SIO_GPIO_HI_OUT_CLR_GPIO_BITS, 0x0000ffff
.equ	SIO_GPIO_HI_OUT_CLR_GPIO_MSB, 15
.equ	SIO_GPIO_HI_OUT_CLR_GPIO_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_OUT_XOR
#  Description : GPIO0...31 output value XOR
#                Perform an atomic bitwise XOR on GPIO_OUT, i.e. `GPIO_OUT ^=
#                wdata`
.equ	SIO_GPIO_OUT_XOR_OFFSET, 0x00000028
.equ	SIO_GPIO_OUT_XOR_BITS, 0xffffffff
.equ	SIO_GPIO_OUT_XOR_RESET, 0x00000000
.equ	SIO_GPIO_OUT_XOR_MSB, 31
.equ	SIO_GPIO_OUT_XOR_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_HI_OUT_XOR
#  Description : Output value XOR for GPIO32..47, QSPI IOs and USB pins.
#                Perform an atomic bitwise XOR on GPIO_HI_OUT, i.e. `GPIO_HI_OUT
#                ^= wdata`
.equ	SIO_GPIO_HI_OUT_XOR_OFFSET, 0x0000002c
.equ	SIO_GPIO_HI_OUT_XOR_BITS, 0xff00ffff
.equ	SIO_GPIO_HI_OUT_XOR_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_XOR_QSPI_SD
.equ	SIO_GPIO_HI_OUT_XOR_QSPI_SD_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_XOR_QSPI_SD_BITS, 0xf0000000
.equ	SIO_GPIO_HI_OUT_XOR_QSPI_SD_MSB, 31
.equ	SIO_GPIO_HI_OUT_XOR_QSPI_SD_LSB, 28
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_XOR_QSPI_CSN
.equ	SIO_GPIO_HI_OUT_XOR_QSPI_CSN_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_XOR_QSPI_CSN_BITS, 0x08000000
.equ	SIO_GPIO_HI_OUT_XOR_QSPI_CSN_MSB, 27
.equ	SIO_GPIO_HI_OUT_XOR_QSPI_CSN_LSB, 27
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_XOR_QSPI_SCK
.equ	SIO_GPIO_HI_OUT_XOR_QSPI_SCK_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_XOR_QSPI_SCK_BITS, 0x04000000
.equ	SIO_GPIO_HI_OUT_XOR_QSPI_SCK_MSB, 26
.equ	SIO_GPIO_HI_OUT_XOR_QSPI_SCK_LSB, 26
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_XOR_USB_DM
.equ	SIO_GPIO_HI_OUT_XOR_USB_DM_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_XOR_USB_DM_BITS, 0x02000000
.equ	SIO_GPIO_HI_OUT_XOR_USB_DM_MSB, 25
.equ	SIO_GPIO_HI_OUT_XOR_USB_DM_LSB, 25
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_XOR_USB_DP
.equ	SIO_GPIO_HI_OUT_XOR_USB_DP_RESET, 0x0
.equ	SIO_GPIO_HI_OUT_XOR_USB_DP_BITS, 0x01000000
.equ	SIO_GPIO_HI_OUT_XOR_USB_DP_MSB, 24
.equ	SIO_GPIO_HI_OUT_XOR_USB_DP_LSB, 24
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OUT_XOR_GPIO
.equ	SIO_GPIO_HI_OUT_XOR_GPIO_RESET, 0x0000
.equ	SIO_GPIO_HI_OUT_XOR_GPIO_BITS, 0x0000ffff
.equ	SIO_GPIO_HI_OUT_XOR_GPIO_MSB, 15
.equ	SIO_GPIO_HI_OUT_XOR_GPIO_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_OE
#  Description : GPIO0...31 output enable
#                Set output enable (1/0 -> output/input) for GPIO0...31. Reading
#                back gives the last value written.
# 
#                If core 0 and core 1 both write to GPIO_OE simultaneously (or
#                to a SET/CLR/XOR alias), the result is as though the write from
#                core 0 took place first, and the write from core 1 was then
#                applied to that intermediate result.
# 
#                In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL)
#                ignore writes, and their output status reads back as zero. This
#                is also true for SET/CLR/XOR aliases of this register.
.equ	SIO_GPIO_OE_OFFSET, 0x00000030
.equ	SIO_GPIO_OE_BITS, 0xffffffff
.equ	SIO_GPIO_OE_RESET, 0x00000000
.equ	SIO_GPIO_OE_MSB, 31
.equ	SIO_GPIO_OE_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_HI_OE
#  Description : Output enable value for GPIO32...47, QSPI IOs and USB pins.
# 
#                Write output enable (1/0 -> output/input). Reading back gives
#                the last value written. If core 0 and core 1 both write to
#                GPIO_HI_OE simultaneously (or to a SET/CLR/XOR alias), the
#                result is as though the write from core 0 took place first, and
#                the write from core 1 was then applied to that intermediate
#                result.
# 
#                In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL)
#                ignore writes, and their output status reads back as zero. This
#                is also true for SET/CLR/XOR aliases of this register.
.equ	SIO_GPIO_HI_OE_OFFSET, 0x00000034
.equ	SIO_GPIO_HI_OE_BITS, 0xff00ffff
.equ	SIO_GPIO_HI_OE_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_QSPI_SD
#  Description : Output enable value for QSPI SD0 (MOSI), SD1 (MISO), SD2 and
#                SD3 pins
.equ	SIO_GPIO_HI_OE_QSPI_SD_RESET, 0x0
.equ	SIO_GPIO_HI_OE_QSPI_SD_BITS, 0xf0000000
.equ	SIO_GPIO_HI_OE_QSPI_SD_MSB, 31
.equ	SIO_GPIO_HI_OE_QSPI_SD_LSB, 28
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_QSPI_CSN
#  Description : Output enable value for QSPI CSn pin
.equ	SIO_GPIO_HI_OE_QSPI_CSN_RESET, 0x0
.equ	SIO_GPIO_HI_OE_QSPI_CSN_BITS, 0x08000000
.equ	SIO_GPIO_HI_OE_QSPI_CSN_MSB, 27
.equ	SIO_GPIO_HI_OE_QSPI_CSN_LSB, 27
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_QSPI_SCK
#  Description : Output enable value for QSPI SCK pin
.equ	SIO_GPIO_HI_OE_QSPI_SCK_RESET, 0x0
.equ	SIO_GPIO_HI_OE_QSPI_SCK_BITS, 0x04000000
.equ	SIO_GPIO_HI_OE_QSPI_SCK_MSB, 26
.equ	SIO_GPIO_HI_OE_QSPI_SCK_LSB, 26
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_USB_DM
#  Description : Output enable value for USB D- pin
.equ	SIO_GPIO_HI_OE_USB_DM_RESET, 0x0
.equ	SIO_GPIO_HI_OE_USB_DM_BITS, 0x02000000
.equ	SIO_GPIO_HI_OE_USB_DM_MSB, 25
.equ	SIO_GPIO_HI_OE_USB_DM_LSB, 25
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_USB_DP
#  Description : Output enable value for USB D+ pin
.equ	SIO_GPIO_HI_OE_USB_DP_RESET, 0x0
.equ	SIO_GPIO_HI_OE_USB_DP_BITS, 0x01000000
.equ	SIO_GPIO_HI_OE_USB_DP_MSB, 24
.equ	SIO_GPIO_HI_OE_USB_DP_LSB, 24
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_GPIO
#  Description : Output enable value for GPIO32...47
.equ	SIO_GPIO_HI_OE_GPIO_RESET, 0x0000
.equ	SIO_GPIO_HI_OE_GPIO_BITS, 0x0000ffff
.equ	SIO_GPIO_HI_OE_GPIO_MSB, 15
.equ	SIO_GPIO_HI_OE_GPIO_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_OE_SET
#  Description : GPIO0...31 output enable set
#                Perform an atomic bit-set on GPIO_OE, i.e. `GPIO_OE |= wdata`
.equ	SIO_GPIO_OE_SET_OFFSET, 0x00000038
.equ	SIO_GPIO_OE_SET_BITS, 0xffffffff
.equ	SIO_GPIO_OE_SET_RESET, 0x00000000
.equ	SIO_GPIO_OE_SET_MSB, 31
.equ	SIO_GPIO_OE_SET_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_HI_OE_SET
#  Description : Output enable set for GPIO32...47, QSPI IOs and USB pins.
#                Perform an atomic bit-set on GPIO_HI_OE, i.e. `GPIO_HI_OE |=
#                wdata`
.equ	SIO_GPIO_HI_OE_SET_OFFSET, 0x0000003c
.equ	SIO_GPIO_HI_OE_SET_BITS, 0xff00ffff
.equ	SIO_GPIO_HI_OE_SET_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_SET_QSPI_SD
.equ	SIO_GPIO_HI_OE_SET_QSPI_SD_RESET, 0x0
.equ	SIO_GPIO_HI_OE_SET_QSPI_SD_BITS, 0xf0000000
.equ	SIO_GPIO_HI_OE_SET_QSPI_SD_MSB, 31
.equ	SIO_GPIO_HI_OE_SET_QSPI_SD_LSB, 28
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_SET_QSPI_CSN
.equ	SIO_GPIO_HI_OE_SET_QSPI_CSN_RESET, 0x0
.equ	SIO_GPIO_HI_OE_SET_QSPI_CSN_BITS, 0x08000000
.equ	SIO_GPIO_HI_OE_SET_QSPI_CSN_MSB, 27
.equ	SIO_GPIO_HI_OE_SET_QSPI_CSN_LSB, 27
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_SET_QSPI_SCK
.equ	SIO_GPIO_HI_OE_SET_QSPI_SCK_RESET, 0x0
.equ	SIO_GPIO_HI_OE_SET_QSPI_SCK_BITS, 0x04000000
.equ	SIO_GPIO_HI_OE_SET_QSPI_SCK_MSB, 26
.equ	SIO_GPIO_HI_OE_SET_QSPI_SCK_LSB, 26
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_SET_USB_DM
.equ	SIO_GPIO_HI_OE_SET_USB_DM_RESET, 0x0
.equ	SIO_GPIO_HI_OE_SET_USB_DM_BITS, 0x02000000
.equ	SIO_GPIO_HI_OE_SET_USB_DM_MSB, 25
.equ	SIO_GPIO_HI_OE_SET_USB_DM_LSB, 25
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_SET_USB_DP
.equ	SIO_GPIO_HI_OE_SET_USB_DP_RESET, 0x0
.equ	SIO_GPIO_HI_OE_SET_USB_DP_BITS, 0x01000000
.equ	SIO_GPIO_HI_OE_SET_USB_DP_MSB, 24
.equ	SIO_GPIO_HI_OE_SET_USB_DP_LSB, 24
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_SET_GPIO
.equ	SIO_GPIO_HI_OE_SET_GPIO_RESET, 0x0000
.equ	SIO_GPIO_HI_OE_SET_GPIO_BITS, 0x0000ffff
.equ	SIO_GPIO_HI_OE_SET_GPIO_MSB, 15
.equ	SIO_GPIO_HI_OE_SET_GPIO_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_OE_CLR
#  Description : GPIO0...31 output enable clear
#                Perform an atomic bit-clear on GPIO_OE, i.e. `GPIO_OE &=
#                ~wdata`
.equ	SIO_GPIO_OE_CLR_OFFSET, 0x00000040
.equ	SIO_GPIO_OE_CLR_BITS, 0xffffffff
.equ	SIO_GPIO_OE_CLR_RESET, 0x00000000
.equ	SIO_GPIO_OE_CLR_MSB, 31
.equ	SIO_GPIO_OE_CLR_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_HI_OE_CLR
#  Description : Output enable clear for GPIO32...47, QSPI IOs and USB pins.
#                Perform an atomic bit-clear on GPIO_HI_OE, i.e. `GPIO_HI_OE &=
#                ~wdata`
.equ	SIO_GPIO_HI_OE_CLR_OFFSET, 0x00000044
.equ	SIO_GPIO_HI_OE_CLR_BITS, 0xff00ffff
.equ	SIO_GPIO_HI_OE_CLR_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_CLR_QSPI_SD
.equ	SIO_GPIO_HI_OE_CLR_QSPI_SD_RESET, 0x0
.equ	SIO_GPIO_HI_OE_CLR_QSPI_SD_BITS, 0xf0000000
.equ	SIO_GPIO_HI_OE_CLR_QSPI_SD_MSB, 31
.equ	SIO_GPIO_HI_OE_CLR_QSPI_SD_LSB, 28
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_CLR_QSPI_CSN
.equ	SIO_GPIO_HI_OE_CLR_QSPI_CSN_RESET, 0x0
.equ	SIO_GPIO_HI_OE_CLR_QSPI_CSN_BITS, 0x08000000
.equ	SIO_GPIO_HI_OE_CLR_QSPI_CSN_MSB, 27
.equ	SIO_GPIO_HI_OE_CLR_QSPI_CSN_LSB, 27
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_CLR_QSPI_SCK
.equ	SIO_GPIO_HI_OE_CLR_QSPI_SCK_RESET, 0x0
