konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/sio.inc
.equ	SIO_GPIO_HI_OE_CLR_QSPI_SCK_BITS, 0x04000000
.equ	SIO_GPIO_HI_OE_CLR_QSPI_SCK_MSB, 26
.equ	SIO_GPIO_HI_OE_CLR_QSPI_SCK_LSB, 26
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_CLR_USB_DM
.equ	SIO_GPIO_HI_OE_CLR_USB_DM_RESET, 0x0
.equ	SIO_GPIO_HI_OE_CLR_USB_DM_BITS, 0x02000000
.equ	SIO_GPIO_HI_OE_CLR_USB_DM_MSB, 25
.equ	SIO_GPIO_HI_OE_CLR_USB_DM_LSB, 25
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_CLR_USB_DP
.equ	SIO_GPIO_HI_OE_CLR_USB_DP_RESET, 0x0
.equ	SIO_GPIO_HI_OE_CLR_USB_DP_BITS, 0x01000000
.equ	SIO_GPIO_HI_OE_CLR_USB_DP_MSB, 24
.equ	SIO_GPIO_HI_OE_CLR_USB_DP_LSB, 24
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_CLR_GPIO
.equ	SIO_GPIO_HI_OE_CLR_GPIO_RESET, 0x0000
.equ	SIO_GPIO_HI_OE_CLR_GPIO_BITS, 0x0000ffff
.equ	SIO_GPIO_HI_OE_CLR_GPIO_MSB, 15
.equ	SIO_GPIO_HI_OE_CLR_GPIO_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_OE_XOR
#  Description : GPIO0...31 output enable XOR
#                Perform an atomic bitwise XOR on GPIO_OE, i.e. `GPIO_OE ^=
#                wdata`
.equ	SIO_GPIO_OE_XOR_OFFSET, 0x00000048
.equ	SIO_GPIO_OE_XOR_BITS, 0xffffffff
.equ	SIO_GPIO_OE_XOR_RESET, 0x00000000
.equ	SIO_GPIO_OE_XOR_MSB, 31
.equ	SIO_GPIO_OE_XOR_LSB, 0
#  =============================================================================
#  Register    : SIO_GPIO_HI_OE_XOR
#  Description : Output enable XOR for GPIO32...47, QSPI IOs and USB pins.
#                Perform an atomic bitwise XOR on GPIO_HI_OE, i.e. `GPIO_HI_OE
#                ^= wdata`
.equ	SIO_GPIO_HI_OE_XOR_OFFSET, 0x0000004c
.equ	SIO_GPIO_HI_OE_XOR_BITS, 0xff00ffff
.equ	SIO_GPIO_HI_OE_XOR_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_XOR_QSPI_SD
.equ	SIO_GPIO_HI_OE_XOR_QSPI_SD_RESET, 0x0
.equ	SIO_GPIO_HI_OE_XOR_QSPI_SD_BITS, 0xf0000000
.equ	SIO_GPIO_HI_OE_XOR_QSPI_SD_MSB, 31
.equ	SIO_GPIO_HI_OE_XOR_QSPI_SD_LSB, 28
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_XOR_QSPI_CSN
.equ	SIO_GPIO_HI_OE_XOR_QSPI_CSN_RESET, 0x0
.equ	SIO_GPIO_HI_OE_XOR_QSPI_CSN_BITS, 0x08000000
.equ	SIO_GPIO_HI_OE_XOR_QSPI_CSN_MSB, 27
.equ	SIO_GPIO_HI_OE_XOR_QSPI_CSN_LSB, 27
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_XOR_QSPI_SCK
.equ	SIO_GPIO_HI_OE_XOR_QSPI_SCK_RESET, 0x0
.equ	SIO_GPIO_HI_OE_XOR_QSPI_SCK_BITS, 0x04000000
.equ	SIO_GPIO_HI_OE_XOR_QSPI_SCK_MSB, 26
.equ	SIO_GPIO_HI_OE_XOR_QSPI_SCK_LSB, 26
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_XOR_USB_DM
.equ	SIO_GPIO_HI_OE_XOR_USB_DM_RESET, 0x0
.equ	SIO_GPIO_HI_OE_XOR_USB_DM_BITS, 0x02000000
.equ	SIO_GPIO_HI_OE_XOR_USB_DM_MSB, 25
.equ	SIO_GPIO_HI_OE_XOR_USB_DM_LSB, 25
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_XOR_USB_DP
.equ	SIO_GPIO_HI_OE_XOR_USB_DP_RESET, 0x0
.equ	SIO_GPIO_HI_OE_XOR_USB_DP_BITS, 0x01000000
.equ	SIO_GPIO_HI_OE_XOR_USB_DP_MSB, 24
.equ	SIO_GPIO_HI_OE_XOR_USB_DP_LSB, 24
#  -----------------------------------------------------------------------------
#  Field       : SIO_GPIO_HI_OE_XOR_GPIO
.equ	SIO_GPIO_HI_OE_XOR_GPIO_RESET, 0x0000
.equ	SIO_GPIO_HI_OE_XOR_GPIO_BITS, 0x0000ffff
.equ	SIO_GPIO_HI_OE_XOR_GPIO_MSB, 15
.equ	SIO_GPIO_HI_OE_XOR_GPIO_LSB, 0
#  =============================================================================
#  Register    : SIO_FIFO_ST
#  Description : Status register for inter-core FIFOs (mailboxes).
#                There is one FIFO in the core 0 -> core 1 direction, and one
#                core 1 -> core 0. Both are 32 bits wide and 8 words deep.
#                Core 0 can see the read side of the 1->0 FIFO (RX), and the
#                write side of 0->1 FIFO (TX).
#                Core 1 can see the read side of the 0->1 FIFO (RX), and the
#                write side of 1->0 FIFO (TX).
#                The SIO IRQ for each core is the logical OR of the VLD, WOF and
#                ROE fields of its FIFO_ST register.
.equ	SIO_FIFO_ST_OFFSET, 0x00000050
.equ	SIO_FIFO_ST_BITS, 0x0000000f
.equ	SIO_FIFO_ST_RESET, 0x00000002
#  -----------------------------------------------------------------------------
#  Field       : SIO_FIFO_ST_ROE
#  Description : Sticky flag indicating the RX FIFO was read when empty. This
#                read was ignored by the FIFO.
.equ	SIO_FIFO_ST_ROE_RESET, 0x0
.equ	SIO_FIFO_ST_ROE_BITS, 0x00000008
.equ	SIO_FIFO_ST_ROE_MSB, 3
.equ	SIO_FIFO_ST_ROE_LSB, 3
#  -----------------------------------------------------------------------------
#  Field       : SIO_FIFO_ST_WOF
#  Description : Sticky flag indicating the TX FIFO was written when full. This
#                write was ignored by the FIFO.
.equ	SIO_FIFO_ST_WOF_RESET, 0x0
.equ	SIO_FIFO_ST_WOF_BITS, 0x00000004
.equ	SIO_FIFO_ST_WOF_MSB, 2
.equ	SIO_FIFO_ST_WOF_LSB, 2
#  -----------------------------------------------------------------------------
#  Field       : SIO_FIFO_ST_RDY
#  Description : Value is 1 if this core's TX FIFO is not full (i.e. if FIFO_WR
#                is ready for more data)
.equ	SIO_FIFO_ST_RDY_RESET, 0x1
.equ	SIO_FIFO_ST_RDY_BITS, 0x00000002
.equ	SIO_FIFO_ST_RDY_MSB, 1
.equ	SIO_FIFO_ST_RDY_LSB, 1
#  -----------------------------------------------------------------------------
#  Field       : SIO_FIFO_ST_VLD
#  Description : Value is 1 if this core's RX FIFO is not empty (i.e. if FIFO_RD
#                is valid)
.equ	SIO_FIFO_ST_VLD_RESET, 0x0
.equ	SIO_FIFO_ST_VLD_BITS, 0x00000001
.equ	SIO_FIFO_ST_VLD_MSB, 0
.equ	SIO_FIFO_ST_VLD_LSB, 0
#  =============================================================================
#  Register    : SIO_FIFO_WR
#  Description : Write access to this core's TX FIFO
.equ	SIO_FIFO_WR_OFFSET, 0x00000054
.equ	SIO_FIFO_WR_BITS, 0xffffffff
.equ	SIO_FIFO_WR_RESET, 0x00000000
.equ	SIO_FIFO_WR_MSB, 31
.equ	SIO_FIFO_WR_LSB, 0
#  =============================================================================
#  Register    : SIO_FIFO_RD
#  Description : Read access to this core's RX FIFO
.equ	SIO_FIFO_RD_OFFSET, 0x00000058
.equ	SIO_FIFO_RD_BITS, 0xffffffff
.equ	SIO_FIFO_RD_MSB, 31
.equ	SIO_FIFO_RD_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK_ST
#  Description : Spinlock state
#                A bitmap containing the state of all 32 spinlocks (1=locked).
#                Mainly intended for debugging.
.equ	SIO_SPINLOCK_ST_OFFSET, 0x0000005c
.equ	SIO_SPINLOCK_ST_BITS, 0xffffffff
.equ	SIO_SPINLOCK_ST_RESET, 0x00000000
.equ	SIO_SPINLOCK_ST_MSB, 31
.equ	SIO_SPINLOCK_ST_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_ACCUM0
#  Description : Read/write access to accumulator 0
.equ	SIO_INTERP0_ACCUM0_OFFSET, 0x00000080
.equ	SIO_INTERP0_ACCUM0_BITS, 0xffffffff
.equ	SIO_INTERP0_ACCUM0_RESET, 0x00000000
.equ	SIO_INTERP0_ACCUM0_MSB, 31
.equ	SIO_INTERP0_ACCUM0_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_ACCUM1
#  Description : Read/write access to accumulator 1
.equ	SIO_INTERP0_ACCUM1_OFFSET, 0x00000084
.equ	SIO_INTERP0_ACCUM1_BITS, 0xffffffff
.equ	SIO_INTERP0_ACCUM1_RESET, 0x00000000
.equ	SIO_INTERP0_ACCUM1_MSB, 31
.equ	SIO_INTERP0_ACCUM1_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_BASE0
#  Description : Read/write access to BASE0 register.
.equ	SIO_INTERP0_BASE0_OFFSET, 0x00000088
.equ	SIO_INTERP0_BASE0_BITS, 0xffffffff
.equ	SIO_INTERP0_BASE0_RESET, 0x00000000
.equ	SIO_INTERP0_BASE0_MSB, 31
.equ	SIO_INTERP0_BASE0_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_BASE1
#  Description : Read/write access to BASE1 register.
.equ	SIO_INTERP0_BASE1_OFFSET, 0x0000008c
.equ	SIO_INTERP0_BASE1_BITS, 0xffffffff
.equ	SIO_INTERP0_BASE1_RESET, 0x00000000
.equ	SIO_INTERP0_BASE1_MSB, 31
.equ	SIO_INTERP0_BASE1_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_BASE2
#  Description : Read/write access to BASE2 register.
.equ	SIO_INTERP0_BASE2_OFFSET, 0x00000090
.equ	SIO_INTERP0_BASE2_BITS, 0xffffffff
.equ	SIO_INTERP0_BASE2_RESET, 0x00000000
.equ	SIO_INTERP0_BASE2_MSB, 31
.equ	SIO_INTERP0_BASE2_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_POP_LANE0
#  Description : Read LANE0 result, and simultaneously write lane results to
#                both accumulators (POP).
.equ	SIO_INTERP0_POP_LANE0_OFFSET, 0x00000094
.equ	SIO_INTERP0_POP_LANE0_BITS, 0xffffffff
.equ	SIO_INTERP0_POP_LANE0_RESET, 0x00000000
.equ	SIO_INTERP0_POP_LANE0_MSB, 31
.equ	SIO_INTERP0_POP_LANE0_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_POP_LANE1
#  Description : Read LANE1 result, and simultaneously write lane results to
#                both accumulators (POP).
.equ	SIO_INTERP0_POP_LANE1_OFFSET, 0x00000098
.equ	SIO_INTERP0_POP_LANE1_BITS, 0xffffffff
.equ	SIO_INTERP0_POP_LANE1_RESET, 0x00000000
.equ	SIO_INTERP0_POP_LANE1_MSB, 31
.equ	SIO_INTERP0_POP_LANE1_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_POP_FULL
#  Description : Read FULL result, and simultaneously write lane results to both
#                accumulators (POP).
.equ	SIO_INTERP0_POP_FULL_OFFSET, 0x0000009c
.equ	SIO_INTERP0_POP_FULL_BITS, 0xffffffff
.equ	SIO_INTERP0_POP_FULL_RESET, 0x00000000
.equ	SIO_INTERP0_POP_FULL_MSB, 31
.equ	SIO_INTERP0_POP_FULL_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_PEEK_LANE0
#  Description : Read LANE0 result, without altering any internal state (PEEK).
.equ	SIO_INTERP0_PEEK_LANE0_OFFSET, 0x000000a0
.equ	SIO_INTERP0_PEEK_LANE0_BITS, 0xffffffff
.equ	SIO_INTERP0_PEEK_LANE0_RESET, 0x00000000
.equ	SIO_INTERP0_PEEK_LANE0_MSB, 31
.equ	SIO_INTERP0_PEEK_LANE0_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_PEEK_LANE1
#  Description : Read LANE1 result, without altering any internal state (PEEK).
.equ	SIO_INTERP0_PEEK_LANE1_OFFSET, 0x000000a4
.equ	SIO_INTERP0_PEEK_LANE1_BITS, 0xffffffff
.equ	SIO_INTERP0_PEEK_LANE1_RESET, 0x00000000
.equ	SIO_INTERP0_PEEK_LANE1_MSB, 31
.equ	SIO_INTERP0_PEEK_LANE1_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_PEEK_FULL
#  Description : Read FULL result, without altering any internal state (PEEK).
.equ	SIO_INTERP0_PEEK_FULL_OFFSET, 0x000000a8
.equ	SIO_INTERP0_PEEK_FULL_BITS, 0xffffffff
.equ	SIO_INTERP0_PEEK_FULL_RESET, 0x00000000
.equ	SIO_INTERP0_PEEK_FULL_MSB, 31
.equ	SIO_INTERP0_PEEK_FULL_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_CTRL_LANE0
#  Description : Control register for lane 0
.equ	SIO_INTERP0_CTRL_LANE0_OFFSET, 0x000000ac
.equ	SIO_INTERP0_CTRL_LANE0_BITS, 0x03bfffff
.equ	SIO_INTERP0_CTRL_LANE0_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE0_OVERF
#  Description : Set if either OVERF0 or OVERF1 is set.
.equ	SIO_INTERP0_CTRL_LANE0_OVERF_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE0_OVERF_BITS, 0x02000000
.equ	SIO_INTERP0_CTRL_LANE0_OVERF_MSB, 25
.equ	SIO_INTERP0_CTRL_LANE0_OVERF_LSB, 25
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE0_OVERF1
#  Description : Indicates if any masked-off MSBs in ACCUM1 are set.
.equ	SIO_INTERP0_CTRL_LANE0_OVERF1_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE0_OVERF1_BITS, 0x01000000
.equ	SIO_INTERP0_CTRL_LANE0_OVERF1_MSB, 24
.equ	SIO_INTERP0_CTRL_LANE0_OVERF1_LSB, 24
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE0_OVERF0
#  Description : Indicates if any masked-off MSBs in ACCUM0 are set.
.equ	SIO_INTERP0_CTRL_LANE0_OVERF0_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE0_OVERF0_BITS, 0x00800000
.equ	SIO_INTERP0_CTRL_LANE0_OVERF0_MSB, 23
.equ	SIO_INTERP0_CTRL_LANE0_OVERF0_LSB, 23
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE0_BLEND
#  Description : Only present on INTERP0 on each core. If BLEND mode is enabled:
#                - LANE1 result is a linear interpolation between BASE0 and
#                BASE1, controlled
#                by the 8 LSBs of lane 1 shift and mask value (a fractional
#                number between
#                0 and 255/256ths)
#                - LANE0 result does not have BASE0 added (yields only the 8
#                LSBs of lane 1 shift+mask value)
#                - FULL result does not have lane 1 shift+mask value added
#                (BASE2 + lane 0 shift+mask)
#                LANE1 SIGNED flag controls whether the interpolation is signed
#                or unsigned.
.equ	SIO_INTERP0_CTRL_LANE0_BLEND_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE0_BLEND_BITS, 0x00200000
.equ	SIO_INTERP0_CTRL_LANE0_BLEND_MSB, 21
.equ	SIO_INTERP0_CTRL_LANE0_BLEND_LSB, 21
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE0_FORCE_MSB
#  Description : ORed into bits 29:28 of the lane result presented to the
#                processor on the bus.
#                No effect on the internal 32-bit datapath. Handy for using a
#                lane to generate sequence
#                of pointers into flash or SRAM.
.equ	SIO_INTERP0_CTRL_LANE0_FORCE_MSB_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE0_FORCE_MSB_BITS, 0x00180000
.equ	SIO_INTERP0_CTRL_LANE0_FORCE_MSB_MSB, 20
.equ	SIO_INTERP0_CTRL_LANE0_FORCE_MSB_LSB, 19
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE0_ADD_RAW
#  Description : If 1, mask + shift is bypassed for LANE0 result. This does not
#                affect FULL result.
.equ	SIO_INTERP0_CTRL_LANE0_ADD_RAW_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE0_ADD_RAW_BITS, 0x00040000
.equ	SIO_INTERP0_CTRL_LANE0_ADD_RAW_MSB, 18
.equ	SIO_INTERP0_CTRL_LANE0_ADD_RAW_LSB, 18
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE0_CROSS_RESULT
#  Description : If 1, feed the opposite lane's result into this lane's
#                accumulator on POP.
.equ	SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_BITS, 0x00020000
.equ	SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_MSB, 17
.equ	SIO_INTERP0_CTRL_LANE0_CROSS_RESULT_LSB, 17
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE0_CROSS_INPUT
#  Description : If 1, feed the opposite lane's accumulator into this lane's
#                shift + mask hardware.
#                Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is
#                before the shift+mask bypass)
.equ	SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_BITS, 0x00010000
.equ	SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_MSB, 16
.equ	SIO_INTERP0_CTRL_LANE0_CROSS_INPUT_LSB, 16
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE0_SIGNED
#  Description : If SIGNED is set, the shifted and masked accumulator value is
#                sign-extended to 32 bits
#                before adding to BASE0, and LANE0 PEEK/POP appear extended to
#                32 bits when read by processor.
.equ	SIO_INTERP0_CTRL_LANE0_SIGNED_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE0_SIGNED_BITS, 0x00008000
.equ	SIO_INTERP0_CTRL_LANE0_SIGNED_MSB, 15
.equ	SIO_INTERP0_CTRL_LANE0_SIGNED_LSB, 15
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE0_MASK_MSB
#  Description : The most-significant bit allowed to pass by the mask
#                (inclusive)
#                Setting MSB < LSB may cause chip to turn inside-out
.equ	SIO_INTERP0_CTRL_LANE0_MASK_MSB_RESET, 0x00
.equ	SIO_INTERP0_CTRL_LANE0_MASK_MSB_BITS, 0x00007c00
.equ	SIO_INTERP0_CTRL_LANE0_MASK_MSB_MSB, 14
.equ	SIO_INTERP0_CTRL_LANE0_MASK_MSB_LSB, 10
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE0_MASK_LSB
#  Description : The least-significant bit allowed to pass by the mask
#                (inclusive)
.equ	SIO_INTERP0_CTRL_LANE0_MASK_LSB_RESET, 0x00
.equ	SIO_INTERP0_CTRL_LANE0_MASK_LSB_BITS, 0x000003e0
.equ	SIO_INTERP0_CTRL_LANE0_MASK_LSB_MSB, 9
.equ	SIO_INTERP0_CTRL_LANE0_MASK_LSB_LSB, 5
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE0_SHIFT
#  Description : Right-rotate applied to accumulator before masking. By
#                appropriately configuring the masks, left and right shifts can
#                be synthesised.
.equ	SIO_INTERP0_CTRL_LANE0_SHIFT_RESET, 0x00
.equ	SIO_INTERP0_CTRL_LANE0_SHIFT_BITS, 0x0000001f
.equ	SIO_INTERP0_CTRL_LANE0_SHIFT_MSB, 4
.equ	SIO_INTERP0_CTRL_LANE0_SHIFT_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_CTRL_LANE1
#  Description : Control register for lane 1
.equ	SIO_INTERP0_CTRL_LANE1_OFFSET, 0x000000b0
.equ	SIO_INTERP0_CTRL_LANE1_BITS, 0x001fffff
.equ	SIO_INTERP0_CTRL_LANE1_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE1_FORCE_MSB
#  Description : ORed into bits 29:28 of the lane result presented to the
#                processor on the bus.
#                No effect on the internal 32-bit datapath. Handy for using a
#                lane to generate sequence
#                of pointers into flash or SRAM.
.equ	SIO_INTERP0_CTRL_LANE1_FORCE_MSB_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE1_FORCE_MSB_BITS, 0x00180000
.equ	SIO_INTERP0_CTRL_LANE1_FORCE_MSB_MSB, 20
.equ	SIO_INTERP0_CTRL_LANE1_FORCE_MSB_LSB, 19
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE1_ADD_RAW
#  Description : If 1, mask + shift is bypassed for LANE1 result. This does not
#                affect FULL result.
.equ	SIO_INTERP0_CTRL_LANE1_ADD_RAW_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE1_ADD_RAW_BITS, 0x00040000
.equ	SIO_INTERP0_CTRL_LANE1_ADD_RAW_MSB, 18
.equ	SIO_INTERP0_CTRL_LANE1_ADD_RAW_LSB, 18
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE1_CROSS_RESULT
#  Description : If 1, feed the opposite lane's result into this lane's
#                accumulator on POP.
.equ	SIO_INTERP0_CTRL_LANE1_CROSS_RESULT_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE1_CROSS_RESULT_BITS, 0x00020000
.equ	SIO_INTERP0_CTRL_LANE1_CROSS_RESULT_MSB, 17
.equ	SIO_INTERP0_CTRL_LANE1_CROSS_RESULT_LSB, 17
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE1_CROSS_INPUT
#  Description : If 1, feed the opposite lane's accumulator into this lane's
#                shift + mask hardware.
#                Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is
#                before the shift+mask bypass)
.equ	SIO_INTERP0_CTRL_LANE1_CROSS_INPUT_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE1_CROSS_INPUT_BITS, 0x00010000
.equ	SIO_INTERP0_CTRL_LANE1_CROSS_INPUT_MSB, 16
.equ	SIO_INTERP0_CTRL_LANE1_CROSS_INPUT_LSB, 16
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE1_SIGNED
#  Description : If SIGNED is set, the shifted and masked accumulator value is
#                sign-extended to 32 bits
#                before adding to BASE1, and LANE1 PEEK/POP appear extended to
#                32 bits when read by processor.
.equ	SIO_INTERP0_CTRL_LANE1_SIGNED_RESET, 0x0
.equ	SIO_INTERP0_CTRL_LANE1_SIGNED_BITS, 0x00008000
.equ	SIO_INTERP0_CTRL_LANE1_SIGNED_MSB, 15
.equ	SIO_INTERP0_CTRL_LANE1_SIGNED_LSB, 15
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE1_MASK_MSB
#  Description : The most-significant bit allowed to pass by the mask
#                (inclusive)
#                Setting MSB < LSB may cause chip to turn inside-out
.equ	SIO_INTERP0_CTRL_LANE1_MASK_MSB_RESET, 0x00
.equ	SIO_INTERP0_CTRL_LANE1_MASK_MSB_BITS, 0x00007c00
.equ	SIO_INTERP0_CTRL_LANE1_MASK_MSB_MSB, 14
.equ	SIO_INTERP0_CTRL_LANE1_MASK_MSB_LSB, 10
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE1_MASK_LSB
#  Description : The least-significant bit allowed to pass by the mask
#                (inclusive)
.equ	SIO_INTERP0_CTRL_LANE1_MASK_LSB_RESET, 0x00
.equ	SIO_INTERP0_CTRL_LANE1_MASK_LSB_BITS, 0x000003e0
.equ	SIO_INTERP0_CTRL_LANE1_MASK_LSB_MSB, 9
.equ	SIO_INTERP0_CTRL_LANE1_MASK_LSB_LSB, 5
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP0_CTRL_LANE1_SHIFT
#  Description : Right-rotate applied to accumulator before masking. By
#                appropriately configuring the masks, left and right shifts can
#                be synthesised.
.equ	SIO_INTERP0_CTRL_LANE1_SHIFT_RESET, 0x00
.equ	SIO_INTERP0_CTRL_LANE1_SHIFT_BITS, 0x0000001f
.equ	SIO_INTERP0_CTRL_LANE1_SHIFT_MSB, 4
.equ	SIO_INTERP0_CTRL_LANE1_SHIFT_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_ACCUM0_ADD
#  Description : Values written here are atomically added to ACCUM0
#                Reading yields lane 0's raw shift and mask value (BASE0 not
#                added).
.equ	SIO_INTERP0_ACCUM0_ADD_OFFSET, 0x000000b4
.equ	SIO_INTERP0_ACCUM0_ADD_BITS, 0x00ffffff
.equ	SIO_INTERP0_ACCUM0_ADD_RESET, 0x00000000
.equ	SIO_INTERP0_ACCUM0_ADD_MSB, 23
.equ	SIO_INTERP0_ACCUM0_ADD_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_ACCUM1_ADD
#  Description : Values written here are atomically added to ACCUM1
#                Reading yields lane 1's raw shift and mask value (BASE1 not
#                added).
.equ	SIO_INTERP0_ACCUM1_ADD_OFFSET, 0x000000b8
.equ	SIO_INTERP0_ACCUM1_ADD_BITS, 0x00ffffff
.equ	SIO_INTERP0_ACCUM1_ADD_RESET, 0x00000000
.equ	SIO_INTERP0_ACCUM1_ADD_MSB, 23
.equ	SIO_INTERP0_ACCUM1_ADD_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP0_BASE_1AND0
#  Description : On write, the lower 16 bits go to BASE0, upper bits to BASE1
#                simultaneously.
#                Each half is sign-extended to 32 bits if that lane's SIGNED
#                flag is set.
.equ	SIO_INTERP0_BASE_1AND0_OFFSET, 0x000000bc
.equ	SIO_INTERP0_BASE_1AND0_BITS, 0xffffffff
.equ	SIO_INTERP0_BASE_1AND0_RESET, 0x00000000
.equ	SIO_INTERP0_BASE_1AND0_MSB, 31
.equ	SIO_INTERP0_BASE_1AND0_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_ACCUM0
#  Description : Read/write access to accumulator 0
.equ	SIO_INTERP1_ACCUM0_OFFSET, 0x000000c0
.equ	SIO_INTERP1_ACCUM0_BITS, 0xffffffff
.equ	SIO_INTERP1_ACCUM0_RESET, 0x00000000
.equ	SIO_INTERP1_ACCUM0_MSB, 31
.equ	SIO_INTERP1_ACCUM0_LSB, 0
