konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/sio.inc
#  =============================================================================
#  Register    : SIO_INTERP1_ACCUM1
#  Description : Read/write access to accumulator 1
.equ	SIO_INTERP1_ACCUM1_OFFSET, 0x000000c4
.equ	SIO_INTERP1_ACCUM1_BITS, 0xffffffff
.equ	SIO_INTERP1_ACCUM1_RESET, 0x00000000
.equ	SIO_INTERP1_ACCUM1_MSB, 31
.equ	SIO_INTERP1_ACCUM1_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_BASE0
#  Description : Read/write access to BASE0 register.
.equ	SIO_INTERP1_BASE0_OFFSET, 0x000000c8
.equ	SIO_INTERP1_BASE0_BITS, 0xffffffff
.equ	SIO_INTERP1_BASE0_RESET, 0x00000000
.equ	SIO_INTERP1_BASE0_MSB, 31
.equ	SIO_INTERP1_BASE0_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_BASE1
#  Description : Read/write access to BASE1 register.
.equ	SIO_INTERP1_BASE1_OFFSET, 0x000000cc
.equ	SIO_INTERP1_BASE1_BITS, 0xffffffff
.equ	SIO_INTERP1_BASE1_RESET, 0x00000000
.equ	SIO_INTERP1_BASE1_MSB, 31
.equ	SIO_INTERP1_BASE1_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_BASE2
#  Description : Read/write access to BASE2 register.
.equ	SIO_INTERP1_BASE2_OFFSET, 0x000000d0
.equ	SIO_INTERP1_BASE2_BITS, 0xffffffff
.equ	SIO_INTERP1_BASE2_RESET, 0x00000000
.equ	SIO_INTERP1_BASE2_MSB, 31
.equ	SIO_INTERP1_BASE2_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_POP_LANE0
#  Description : Read LANE0 result, and simultaneously write lane results to
#                both accumulators (POP).
.equ	SIO_INTERP1_POP_LANE0_OFFSET, 0x000000d4
.equ	SIO_INTERP1_POP_LANE0_BITS, 0xffffffff
.equ	SIO_INTERP1_POP_LANE0_RESET, 0x00000000
.equ	SIO_INTERP1_POP_LANE0_MSB, 31
.equ	SIO_INTERP1_POP_LANE0_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_POP_LANE1
#  Description : Read LANE1 result, and simultaneously write lane results to
#                both accumulators (POP).
.equ	SIO_INTERP1_POP_LANE1_OFFSET, 0x000000d8
.equ	SIO_INTERP1_POP_LANE1_BITS, 0xffffffff
.equ	SIO_INTERP1_POP_LANE1_RESET, 0x00000000
.equ	SIO_INTERP1_POP_LANE1_MSB, 31
.equ	SIO_INTERP1_POP_LANE1_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_POP_FULL
#  Description : Read FULL result, and simultaneously write lane results to both
#                accumulators (POP).
.equ	SIO_INTERP1_POP_FULL_OFFSET, 0x000000dc
.equ	SIO_INTERP1_POP_FULL_BITS, 0xffffffff
.equ	SIO_INTERP1_POP_FULL_RESET, 0x00000000
.equ	SIO_INTERP1_POP_FULL_MSB, 31
.equ	SIO_INTERP1_POP_FULL_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_PEEK_LANE0
#  Description : Read LANE0 result, without altering any internal state (PEEK).
.equ	SIO_INTERP1_PEEK_LANE0_OFFSET, 0x000000e0
.equ	SIO_INTERP1_PEEK_LANE0_BITS, 0xffffffff
.equ	SIO_INTERP1_PEEK_LANE0_RESET, 0x00000000
.equ	SIO_INTERP1_PEEK_LANE0_MSB, 31
.equ	SIO_INTERP1_PEEK_LANE0_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_PEEK_LANE1
#  Description : Read LANE1 result, without altering any internal state (PEEK).
.equ	SIO_INTERP1_PEEK_LANE1_OFFSET, 0x000000e4
.equ	SIO_INTERP1_PEEK_LANE1_BITS, 0xffffffff
.equ	SIO_INTERP1_PEEK_LANE1_RESET, 0x00000000
.equ	SIO_INTERP1_PEEK_LANE1_MSB, 31
.equ	SIO_INTERP1_PEEK_LANE1_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_PEEK_FULL
#  Description : Read FULL result, without altering any internal state (PEEK).
.equ	SIO_INTERP1_PEEK_FULL_OFFSET, 0x000000e8
.equ	SIO_INTERP1_PEEK_FULL_BITS, 0xffffffff
.equ	SIO_INTERP1_PEEK_FULL_RESET, 0x00000000
.equ	SIO_INTERP1_PEEK_FULL_MSB, 31
.equ	SIO_INTERP1_PEEK_FULL_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_CTRL_LANE0
#  Description : Control register for lane 0
.equ	SIO_INTERP1_CTRL_LANE0_OFFSET, 0x000000ec
.equ	SIO_INTERP1_CTRL_LANE0_BITS, 0x03dfffff
.equ	SIO_INTERP1_CTRL_LANE0_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE0_OVERF
#  Description : Set if either OVERF0 or OVERF1 is set.
.equ	SIO_INTERP1_CTRL_LANE0_OVERF_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE0_OVERF_BITS, 0x02000000
.equ	SIO_INTERP1_CTRL_LANE0_OVERF_MSB, 25
.equ	SIO_INTERP1_CTRL_LANE0_OVERF_LSB, 25
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE0_OVERF1
#  Description : Indicates if any masked-off MSBs in ACCUM1 are set.
.equ	SIO_INTERP1_CTRL_LANE0_OVERF1_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE0_OVERF1_BITS, 0x01000000
.equ	SIO_INTERP1_CTRL_LANE0_OVERF1_MSB, 24
.equ	SIO_INTERP1_CTRL_LANE0_OVERF1_LSB, 24
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE0_OVERF0
#  Description : Indicates if any masked-off MSBs in ACCUM0 are set.
.equ	SIO_INTERP1_CTRL_LANE0_OVERF0_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE0_OVERF0_BITS, 0x00800000
.equ	SIO_INTERP1_CTRL_LANE0_OVERF0_MSB, 23
.equ	SIO_INTERP1_CTRL_LANE0_OVERF0_LSB, 23
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE0_CLAMP
#  Description : Only present on INTERP1 on each core. If CLAMP mode is enabled:
#                - LANE0 result is shifted and masked ACCUM0, clamped by a lower
#                bound of
#                BASE0 and an upper bound of BASE1.
#                - Signedness of these comparisons is determined by
#                LANE0_CTRL_SIGNED
.equ	SIO_INTERP1_CTRL_LANE0_CLAMP_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE0_CLAMP_BITS, 0x00400000
.equ	SIO_INTERP1_CTRL_LANE0_CLAMP_MSB, 22
.equ	SIO_INTERP1_CTRL_LANE0_CLAMP_LSB, 22
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE0_FORCE_MSB
#  Description : ORed into bits 29:28 of the lane result presented to the
#                processor on the bus.
#                No effect on the internal 32-bit datapath. Handy for using a
#                lane to generate sequence
#                of pointers into flash or SRAM.
.equ	SIO_INTERP1_CTRL_LANE0_FORCE_MSB_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE0_FORCE_MSB_BITS, 0x00180000
.equ	SIO_INTERP1_CTRL_LANE0_FORCE_MSB_MSB, 20
.equ	SIO_INTERP1_CTRL_LANE0_FORCE_MSB_LSB, 19
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE0_ADD_RAW
#  Description : If 1, mask + shift is bypassed for LANE0 result. This does not
#                affect FULL result.
.equ	SIO_INTERP1_CTRL_LANE0_ADD_RAW_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE0_ADD_RAW_BITS, 0x00040000
.equ	SIO_INTERP1_CTRL_LANE0_ADD_RAW_MSB, 18
.equ	SIO_INTERP1_CTRL_LANE0_ADD_RAW_LSB, 18
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE0_CROSS_RESULT
#  Description : If 1, feed the opposite lane's result into this lane's
#                accumulator on POP.
.equ	SIO_INTERP1_CTRL_LANE0_CROSS_RESULT_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE0_CROSS_RESULT_BITS, 0x00020000
.equ	SIO_INTERP1_CTRL_LANE0_CROSS_RESULT_MSB, 17
.equ	SIO_INTERP1_CTRL_LANE0_CROSS_RESULT_LSB, 17
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE0_CROSS_INPUT
#  Description : If 1, feed the opposite lane's accumulator into this lane's
#                shift + mask hardware.
#                Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is
#                before the shift+mask bypass)
.equ	SIO_INTERP1_CTRL_LANE0_CROSS_INPUT_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE0_CROSS_INPUT_BITS, 0x00010000
.equ	SIO_INTERP1_CTRL_LANE0_CROSS_INPUT_MSB, 16
.equ	SIO_INTERP1_CTRL_LANE0_CROSS_INPUT_LSB, 16
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE0_SIGNED
#  Description : If SIGNED is set, the shifted and masked accumulator value is
#                sign-extended to 32 bits
#                before adding to BASE0, and LANE0 PEEK/POP appear extended to
#                32 bits when read by processor.
.equ	SIO_INTERP1_CTRL_LANE0_SIGNED_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE0_SIGNED_BITS, 0x00008000
.equ	SIO_INTERP1_CTRL_LANE0_SIGNED_MSB, 15
.equ	SIO_INTERP1_CTRL_LANE0_SIGNED_LSB, 15
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE0_MASK_MSB
#  Description : The most-significant bit allowed to pass by the mask
#                (inclusive)
#                Setting MSB < LSB may cause chip to turn inside-out
.equ	SIO_INTERP1_CTRL_LANE0_MASK_MSB_RESET, 0x00
.equ	SIO_INTERP1_CTRL_LANE0_MASK_MSB_BITS, 0x00007c00
.equ	SIO_INTERP1_CTRL_LANE0_MASK_MSB_MSB, 14
.equ	SIO_INTERP1_CTRL_LANE0_MASK_MSB_LSB, 10
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE0_MASK_LSB
#  Description : The least-significant bit allowed to pass by the mask
#                (inclusive)
.equ	SIO_INTERP1_CTRL_LANE0_MASK_LSB_RESET, 0x00
.equ	SIO_INTERP1_CTRL_LANE0_MASK_LSB_BITS, 0x000003e0
.equ	SIO_INTERP1_CTRL_LANE0_MASK_LSB_MSB, 9
.equ	SIO_INTERP1_CTRL_LANE0_MASK_LSB_LSB, 5
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE0_SHIFT
#  Description : Right-rotate applied to accumulator before masking. By
#                appropriately configuring the masks, left and right shifts can
#                be synthesised.
.equ	SIO_INTERP1_CTRL_LANE0_SHIFT_RESET, 0x00
.equ	SIO_INTERP1_CTRL_LANE0_SHIFT_BITS, 0x0000001f
.equ	SIO_INTERP1_CTRL_LANE0_SHIFT_MSB, 4
.equ	SIO_INTERP1_CTRL_LANE0_SHIFT_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_CTRL_LANE1
#  Description : Control register for lane 1
.equ	SIO_INTERP1_CTRL_LANE1_OFFSET, 0x000000f0
.equ	SIO_INTERP1_CTRL_LANE1_BITS, 0x001fffff
.equ	SIO_INTERP1_CTRL_LANE1_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE1_FORCE_MSB
#  Description : ORed into bits 29:28 of the lane result presented to the
#                processor on the bus.
#                No effect on the internal 32-bit datapath. Handy for using a
#                lane to generate sequence
#                of pointers into flash or SRAM.
.equ	SIO_INTERP1_CTRL_LANE1_FORCE_MSB_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE1_FORCE_MSB_BITS, 0x00180000
.equ	SIO_INTERP1_CTRL_LANE1_FORCE_MSB_MSB, 20
.equ	SIO_INTERP1_CTRL_LANE1_FORCE_MSB_LSB, 19
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE1_ADD_RAW
#  Description : If 1, mask + shift is bypassed for LANE1 result. This does not
#                affect FULL result.
.equ	SIO_INTERP1_CTRL_LANE1_ADD_RAW_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE1_ADD_RAW_BITS, 0x00040000
.equ	SIO_INTERP1_CTRL_LANE1_ADD_RAW_MSB, 18
.equ	SIO_INTERP1_CTRL_LANE1_ADD_RAW_LSB, 18
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE1_CROSS_RESULT
#  Description : If 1, feed the opposite lane's result into this lane's
#                accumulator on POP.
.equ	SIO_INTERP1_CTRL_LANE1_CROSS_RESULT_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE1_CROSS_RESULT_BITS, 0x00020000
.equ	SIO_INTERP1_CTRL_LANE1_CROSS_RESULT_MSB, 17
.equ	SIO_INTERP1_CTRL_LANE1_CROSS_RESULT_LSB, 17
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE1_CROSS_INPUT
#  Description : If 1, feed the opposite lane's accumulator into this lane's
#                shift + mask hardware.
#                Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is
#                before the shift+mask bypass)
.equ	SIO_INTERP1_CTRL_LANE1_CROSS_INPUT_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE1_CROSS_INPUT_BITS, 0x00010000
.equ	SIO_INTERP1_CTRL_LANE1_CROSS_INPUT_MSB, 16
.equ	SIO_INTERP1_CTRL_LANE1_CROSS_INPUT_LSB, 16
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE1_SIGNED
#  Description : If SIGNED is set, the shifted and masked accumulator value is
#                sign-extended to 32 bits
#                before adding to BASE1, and LANE1 PEEK/POP appear extended to
#                32 bits when read by processor.
.equ	SIO_INTERP1_CTRL_LANE1_SIGNED_RESET, 0x0
.equ	SIO_INTERP1_CTRL_LANE1_SIGNED_BITS, 0x00008000
.equ	SIO_INTERP1_CTRL_LANE1_SIGNED_MSB, 15
.equ	SIO_INTERP1_CTRL_LANE1_SIGNED_LSB, 15
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE1_MASK_MSB
#  Description : The most-significant bit allowed to pass by the mask
#                (inclusive)
#                Setting MSB < LSB may cause chip to turn inside-out
.equ	SIO_INTERP1_CTRL_LANE1_MASK_MSB_RESET, 0x00
.equ	SIO_INTERP1_CTRL_LANE1_MASK_MSB_BITS, 0x00007c00
.equ	SIO_INTERP1_CTRL_LANE1_MASK_MSB_MSB, 14
.equ	SIO_INTERP1_CTRL_LANE1_MASK_MSB_LSB, 10
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE1_MASK_LSB
#  Description : The least-significant bit allowed to pass by the mask
#                (inclusive)
.equ	SIO_INTERP1_CTRL_LANE1_MASK_LSB_RESET, 0x00
.equ	SIO_INTERP1_CTRL_LANE1_MASK_LSB_BITS, 0x000003e0
.equ	SIO_INTERP1_CTRL_LANE1_MASK_LSB_MSB, 9
.equ	SIO_INTERP1_CTRL_LANE1_MASK_LSB_LSB, 5
#  -----------------------------------------------------------------------------
#  Field       : SIO_INTERP1_CTRL_LANE1_SHIFT
#  Description : Right-rotate applied to accumulator before masking. By
#                appropriately configuring the masks, left and right shifts can
#                be synthesised.
.equ	SIO_INTERP1_CTRL_LANE1_SHIFT_RESET, 0x00
.equ	SIO_INTERP1_CTRL_LANE1_SHIFT_BITS, 0x0000001f
.equ	SIO_INTERP1_CTRL_LANE1_SHIFT_MSB, 4
.equ	SIO_INTERP1_CTRL_LANE1_SHIFT_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_ACCUM0_ADD
#  Description : Values written here are atomically added to ACCUM0
#                Reading yields lane 0's raw shift and mask value (BASE0 not
#                added).
.equ	SIO_INTERP1_ACCUM0_ADD_OFFSET, 0x000000f4
.equ	SIO_INTERP1_ACCUM0_ADD_BITS, 0x00ffffff
.equ	SIO_INTERP1_ACCUM0_ADD_RESET, 0x00000000
.equ	SIO_INTERP1_ACCUM0_ADD_MSB, 23
.equ	SIO_INTERP1_ACCUM0_ADD_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_ACCUM1_ADD
#  Description : Values written here are atomically added to ACCUM1
#                Reading yields lane 1's raw shift and mask value (BASE1 not
#                added).
.equ	SIO_INTERP1_ACCUM1_ADD_OFFSET, 0x000000f8
.equ	SIO_INTERP1_ACCUM1_ADD_BITS, 0x00ffffff
.equ	SIO_INTERP1_ACCUM1_ADD_RESET, 0x00000000
.equ	SIO_INTERP1_ACCUM1_ADD_MSB, 23
.equ	SIO_INTERP1_ACCUM1_ADD_LSB, 0
#  =============================================================================
#  Register    : SIO_INTERP1_BASE_1AND0
#  Description : On write, the lower 16 bits go to BASE0, upper bits to BASE1
#                simultaneously.
#                Each half is sign-extended to 32 bits if that lane's SIGNED
#                flag is set.
.equ	SIO_INTERP1_BASE_1AND0_OFFSET, 0x000000fc
.equ	SIO_INTERP1_BASE_1AND0_BITS, 0xffffffff
.equ	SIO_INTERP1_BASE_1AND0_RESET, 0x00000000
.equ	SIO_INTERP1_BASE_1AND0_MSB, 31
.equ	SIO_INTERP1_BASE_1AND0_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK0
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK0_OFFSET, 0x00000100
.equ	SIO_SPINLOCK0_BITS, 0xffffffff
.equ	SIO_SPINLOCK0_RESET, 0x00000000
.equ	SIO_SPINLOCK0_MSB, 31
.equ	SIO_SPINLOCK0_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK1
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK1_OFFSET, 0x00000104
.equ	SIO_SPINLOCK1_BITS, 0xffffffff
.equ	SIO_SPINLOCK1_RESET, 0x00000000
.equ	SIO_SPINLOCK1_MSB, 31
.equ	SIO_SPINLOCK1_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK2
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK2_OFFSET, 0x00000108
.equ	SIO_SPINLOCK2_BITS, 0xffffffff
.equ	SIO_SPINLOCK2_RESET, 0x00000000
.equ	SIO_SPINLOCK2_MSB, 31
.equ	SIO_SPINLOCK2_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK3
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK3_OFFSET, 0x0000010c
.equ	SIO_SPINLOCK3_BITS, 0xffffffff
.equ	SIO_SPINLOCK3_RESET, 0x00000000
.equ	SIO_SPINLOCK3_MSB, 31
.equ	SIO_SPINLOCK3_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK4
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK4_OFFSET, 0x00000110
.equ	SIO_SPINLOCK4_BITS, 0xffffffff
.equ	SIO_SPINLOCK4_RESET, 0x00000000
.equ	SIO_SPINLOCK4_MSB, 31
.equ	SIO_SPINLOCK4_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK5
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK5_OFFSET, 0x00000114
.equ	SIO_SPINLOCK5_BITS, 0xffffffff
.equ	SIO_SPINLOCK5_RESET, 0x00000000
.equ	SIO_SPINLOCK5_MSB, 31
.equ	SIO_SPINLOCK5_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK6
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK6_OFFSET, 0x00000118
.equ	SIO_SPINLOCK6_BITS, 0xffffffff
.equ	SIO_SPINLOCK6_RESET, 0x00000000
.equ	SIO_SPINLOCK6_MSB, 31
.equ	SIO_SPINLOCK6_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK7
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK7_OFFSET, 0x0000011c
.equ	SIO_SPINLOCK7_BITS, 0xffffffff
.equ	SIO_SPINLOCK7_RESET, 0x00000000
.equ	SIO_SPINLOCK7_MSB, 31
.equ	SIO_SPINLOCK7_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK8
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK8_OFFSET, 0x00000120
.equ	SIO_SPINLOCK8_BITS, 0xffffffff
.equ	SIO_SPINLOCK8_RESET, 0x00000000
.equ	SIO_SPINLOCK8_MSB, 31
.equ	SIO_SPINLOCK8_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK9
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK9_OFFSET, 0x00000124
.equ	SIO_SPINLOCK9_BITS, 0xffffffff
.equ	SIO_SPINLOCK9_RESET, 0x00000000
.equ	SIO_SPINLOCK9_MSB, 31
.equ	SIO_SPINLOCK9_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK10
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK10_OFFSET, 0x00000128
.equ	SIO_SPINLOCK10_BITS, 0xffffffff
.equ	SIO_SPINLOCK10_RESET, 0x00000000
.equ	SIO_SPINLOCK10_MSB, 31
.equ	SIO_SPINLOCK10_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK11
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
