konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/sio.inc
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK11_OFFSET, 0x0000012c
.equ	SIO_SPINLOCK11_BITS, 0xffffffff
.equ	SIO_SPINLOCK11_RESET, 0x00000000
.equ	SIO_SPINLOCK11_MSB, 31
.equ	SIO_SPINLOCK11_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK12
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK12_OFFSET, 0x00000130
.equ	SIO_SPINLOCK12_BITS, 0xffffffff
.equ	SIO_SPINLOCK12_RESET, 0x00000000
.equ	SIO_SPINLOCK12_MSB, 31
.equ	SIO_SPINLOCK12_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK13
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK13_OFFSET, 0x00000134
.equ	SIO_SPINLOCK13_BITS, 0xffffffff
.equ	SIO_SPINLOCK13_RESET, 0x00000000
.equ	SIO_SPINLOCK13_MSB, 31
.equ	SIO_SPINLOCK13_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK14
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK14_OFFSET, 0x00000138
.equ	SIO_SPINLOCK14_BITS, 0xffffffff
.equ	SIO_SPINLOCK14_RESET, 0x00000000
.equ	SIO_SPINLOCK14_MSB, 31
.equ	SIO_SPINLOCK14_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK15
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK15_OFFSET, 0x0000013c
.equ	SIO_SPINLOCK15_BITS, 0xffffffff
.equ	SIO_SPINLOCK15_RESET, 0x00000000
.equ	SIO_SPINLOCK15_MSB, 31
.equ	SIO_SPINLOCK15_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK16
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK16_OFFSET, 0x00000140
.equ	SIO_SPINLOCK16_BITS, 0xffffffff
.equ	SIO_SPINLOCK16_RESET, 0x00000000
.equ	SIO_SPINLOCK16_MSB, 31
.equ	SIO_SPINLOCK16_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK17
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK17_OFFSET, 0x00000144
.equ	SIO_SPINLOCK17_BITS, 0xffffffff
.equ	SIO_SPINLOCK17_RESET, 0x00000000
.equ	SIO_SPINLOCK17_MSB, 31
.equ	SIO_SPINLOCK17_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK18
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK18_OFFSET, 0x00000148
.equ	SIO_SPINLOCK18_BITS, 0xffffffff
.equ	SIO_SPINLOCK18_RESET, 0x00000000
.equ	SIO_SPINLOCK18_MSB, 31
.equ	SIO_SPINLOCK18_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK19
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK19_OFFSET, 0x0000014c
.equ	SIO_SPINLOCK19_BITS, 0xffffffff
.equ	SIO_SPINLOCK19_RESET, 0x00000000
.equ	SIO_SPINLOCK19_MSB, 31
.equ	SIO_SPINLOCK19_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK20
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK20_OFFSET, 0x00000150
.equ	SIO_SPINLOCK20_BITS, 0xffffffff
.equ	SIO_SPINLOCK20_RESET, 0x00000000
.equ	SIO_SPINLOCK20_MSB, 31
.equ	SIO_SPINLOCK20_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK21
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK21_OFFSET, 0x00000154
.equ	SIO_SPINLOCK21_BITS, 0xffffffff
.equ	SIO_SPINLOCK21_RESET, 0x00000000
.equ	SIO_SPINLOCK21_MSB, 31
.equ	SIO_SPINLOCK21_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK22
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK22_OFFSET, 0x00000158
.equ	SIO_SPINLOCK22_BITS, 0xffffffff
.equ	SIO_SPINLOCK22_RESET, 0x00000000
.equ	SIO_SPINLOCK22_MSB, 31
.equ	SIO_SPINLOCK22_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK23
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK23_OFFSET, 0x0000015c
.equ	SIO_SPINLOCK23_BITS, 0xffffffff
.equ	SIO_SPINLOCK23_RESET, 0x00000000
.equ	SIO_SPINLOCK23_MSB, 31
.equ	SIO_SPINLOCK23_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK24
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK24_OFFSET, 0x00000160
.equ	SIO_SPINLOCK24_BITS, 0xffffffff
.equ	SIO_SPINLOCK24_RESET, 0x00000000
.equ	SIO_SPINLOCK24_MSB, 31
.equ	SIO_SPINLOCK24_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK25
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK25_OFFSET, 0x00000164
.equ	SIO_SPINLOCK25_BITS, 0xffffffff
.equ	SIO_SPINLOCK25_RESET, 0x00000000
.equ	SIO_SPINLOCK25_MSB, 31
.equ	SIO_SPINLOCK25_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK26
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK26_OFFSET, 0x00000168
.equ	SIO_SPINLOCK26_BITS, 0xffffffff
.equ	SIO_SPINLOCK26_RESET, 0x00000000
.equ	SIO_SPINLOCK26_MSB, 31
.equ	SIO_SPINLOCK26_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK27
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK27_OFFSET, 0x0000016c
.equ	SIO_SPINLOCK27_BITS, 0xffffffff
.equ	SIO_SPINLOCK27_RESET, 0x00000000
.equ	SIO_SPINLOCK27_MSB, 31
.equ	SIO_SPINLOCK27_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK28
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK28_OFFSET, 0x00000170
.equ	SIO_SPINLOCK28_BITS, 0xffffffff
.equ	SIO_SPINLOCK28_RESET, 0x00000000
.equ	SIO_SPINLOCK28_MSB, 31
.equ	SIO_SPINLOCK28_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK29
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK29_OFFSET, 0x00000174
.equ	SIO_SPINLOCK29_BITS, 0xffffffff
.equ	SIO_SPINLOCK29_RESET, 0x00000000
.equ	SIO_SPINLOCK29_MSB, 31
.equ	SIO_SPINLOCK29_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK30
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK30_OFFSET, 0x00000178
.equ	SIO_SPINLOCK30_BITS, 0xffffffff
.equ	SIO_SPINLOCK30_RESET, 0x00000000
.equ	SIO_SPINLOCK30_MSB, 31
.equ	SIO_SPINLOCK30_LSB, 0
#  =============================================================================
#  Register    : SIO_SPINLOCK31
#  Description : Reading from a spinlock address will:
#                - Return 0 if lock is already locked
#                - Otherwise return nonzero, and simultaneously claim the lock
# 
#                Writing (any value) releases the lock.
#                If core 0 and core 1 attempt to claim the same lock
#                simultaneously, core 0 wins.
#                The value returned on success is 0x1 << lock number.
.equ	SIO_SPINLOCK31_OFFSET, 0x0000017c
.equ	SIO_SPINLOCK31_BITS, 0xffffffff
.equ	SIO_SPINLOCK31_RESET, 0x00000000
.equ	SIO_SPINLOCK31_MSB, 31
.equ	SIO_SPINLOCK31_LSB, 0
#  =============================================================================
#  Register    : SIO_DOORBELL_OUT_SET
#  Description : Trigger a doorbell interrupt on the opposite core.
# 
#                Write 1 to a bit to set the corresponding bit in DOORBELL_IN on
#                the opposite core. This raises the opposite core's doorbell
#                interrupt.
# 
#                Read to get the status of the doorbells currently asserted on
#                the opposite core. This is equivalent to that core reading its
#                own DOORBELL_IN status.
.equ	SIO_DOORBELL_OUT_SET_OFFSET, 0x00000180
.equ	SIO_DOORBELL_OUT_SET_BITS, 0x000000ff
.equ	SIO_DOORBELL_OUT_SET_RESET, 0x00000000
.equ	SIO_DOORBELL_OUT_SET_MSB, 7
.equ	SIO_DOORBELL_OUT_SET_LSB, 0
#  =============================================================================
#  Register    : SIO_DOORBELL_OUT_CLR
#  Description : Clear doorbells which have been posted to the opposite core.
#                This register is intended for debugging and initialisation
#                purposes.
# 
#                Writing 1 to a bit in DOORBELL_OUT_CLR clears the corresponding
#                bit in DOORBELL_IN on the opposite core. Clearing all bits will
#                cause that core's doorbell interrupt to deassert. Since the
#                usual order of events is for software to send events using
#                DOORBELL_OUT_SET, and acknowledge incoming events by writing to
#                DOORBELL_IN_CLR, this register should be used with caution to
#                avoid race conditions.
# 
#                Reading returns the status of the doorbells currently asserted
#                on the other core, i.e. is equivalent to that core reading its
#                own DOORBELL_IN status.
.equ	SIO_DOORBELL_OUT_CLR_OFFSET, 0x00000184
.equ	SIO_DOORBELL_OUT_CLR_BITS, 0x000000ff
.equ	SIO_DOORBELL_OUT_CLR_RESET, 0x00000000
.equ	SIO_DOORBELL_OUT_CLR_MSB, 7
.equ	SIO_DOORBELL_OUT_CLR_LSB, 0
#  =============================================================================
#  Register    : SIO_DOORBELL_IN_SET
#  Description : Write 1s to trigger doorbell interrupts on this core. Read to
#                get status of doorbells currently asserted on this core.
.equ	SIO_DOORBELL_IN_SET_OFFSET, 0x00000188
.equ	SIO_DOORBELL_IN_SET_BITS, 0x000000ff
.equ	SIO_DOORBELL_IN_SET_RESET, 0x00000000
.equ	SIO_DOORBELL_IN_SET_MSB, 7
.equ	SIO_DOORBELL_IN_SET_LSB, 0
#  =============================================================================
#  Register    : SIO_DOORBELL_IN_CLR
#  Description : Check and acknowledge doorbells posted to this core. This
#                core's doorbell interrupt is asserted when any bit in this
#                register is 1.
# 
#                Write 1 to each bit to clear that bit. The doorbell interrupt
#                deasserts once all bits are cleared. Read to get status of
#                doorbells currently asserted on this core.
.equ	SIO_DOORBELL_IN_CLR_OFFSET, 0x0000018c
.equ	SIO_DOORBELL_IN_CLR_BITS, 0x000000ff
.equ	SIO_DOORBELL_IN_CLR_RESET, 0x00000000
.equ	SIO_DOORBELL_IN_CLR_MSB, 7
.equ	SIO_DOORBELL_IN_CLR_LSB, 0
#  =============================================================================
#  Register    : SIO_PERI_NONSEC
#  Description : Detach certain core-local peripherals from Secure SIO, and
#                attach them to Non-secure SIO, so that Non-secure software can
#                use them. Attempting to access one of these peripherals from
#                the Secure SIO when it is attached to the Non-secure SIO, or
#                vice versa, will generate a bus error.
# 
#                This register is per-core, and is only present on the Secure
#                SIO.
# 
#                Most SIO hardware is duplicated across the Secure and Non-
#                secure SIO, so is not listed in this register.
.equ	SIO_PERI_NONSEC_OFFSET, 0x00000190
.equ	SIO_PERI_NONSEC_BITS, 0x00000023
.equ	SIO_PERI_NONSEC_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_PERI_NONSEC_TMDS
#  Description : IF 1, detach TMDS encoder (of this core) from the Secure SIO,
#                and attach to the Non-secure SIO.
.equ	SIO_PERI_NONSEC_TMDS_RESET, 0x0
.equ	SIO_PERI_NONSEC_TMDS_BITS, 0x00000020
.equ	SIO_PERI_NONSEC_TMDS_MSB, 5
.equ	SIO_PERI_NONSEC_TMDS_LSB, 5
#  -----------------------------------------------------------------------------
#  Field       : SIO_PERI_NONSEC_INTERP1
#  Description : If 1, detach interpolator 1 (of this core) from the Secure SIO,
#                and attach to the Non-secure SIO.
.equ	SIO_PERI_NONSEC_INTERP1_RESET, 0x0
.equ	SIO_PERI_NONSEC_INTERP1_BITS, 0x00000002
.equ	SIO_PERI_NONSEC_INTERP1_MSB, 1
.equ	SIO_PERI_NONSEC_INTERP1_LSB, 1
#  -----------------------------------------------------------------------------
#  Field       : SIO_PERI_NONSEC_INTERP0
#  Description : If 1, detach interpolator 0 (of this core) from the Secure SIO,
#                and attach to the Non-secure SIO.
.equ	SIO_PERI_NONSEC_INTERP0_RESET, 0x0
.equ	SIO_PERI_NONSEC_INTERP0_BITS, 0x00000001
.equ	SIO_PERI_NONSEC_INTERP0_MSB, 0
.equ	SIO_PERI_NONSEC_INTERP0_LSB, 0
#  =============================================================================
#  Register    : SIO_RISCV_SOFTIRQ
#  Description : Control the assertion of the standard software interrupt
#                (MIP.MSIP) on the RISC-V cores.
# 
#                Unlike the RISC-V timer, this interrupt is not routed to a
#                normal system-level interrupt line, so can not be used by the
#                Arm cores.
# 
#                It is safe for both cores to write to this register on the same
#                cycle. The set/clear effect is accumulated across both cores,
#                and then applied. If a flag is both set and cleared on the same
#                cycle, only the set takes effect.
.equ	SIO_RISCV_SOFTIRQ_OFFSET, 0x000001a0
.equ	SIO_RISCV_SOFTIRQ_BITS, 0x00000303
.equ	SIO_RISCV_SOFTIRQ_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_RISCV_SOFTIRQ_CORE1_CLR
#  Description : Write 1 to atomically clear the core 1 software interrupt flag.
#                Read to get the status of this flag.
.equ	SIO_RISCV_SOFTIRQ_CORE1_CLR_RESET, 0x0
.equ	SIO_RISCV_SOFTIRQ_CORE1_CLR_BITS, 0x00000200
.equ	SIO_RISCV_SOFTIRQ_CORE1_CLR_MSB, 9
.equ	SIO_RISCV_SOFTIRQ_CORE1_CLR_LSB, 9
#  -----------------------------------------------------------------------------
#  Field       : SIO_RISCV_SOFTIRQ_CORE0_CLR
#  Description : Write 1 to atomically clear the core 0 software interrupt flag.
#                Read to get the status of this flag.
.equ	SIO_RISCV_SOFTIRQ_CORE0_CLR_RESET, 0x0
.equ	SIO_RISCV_SOFTIRQ_CORE0_CLR_BITS, 0x00000100
.equ	SIO_RISCV_SOFTIRQ_CORE0_CLR_MSB, 8
.equ	SIO_RISCV_SOFTIRQ_CORE0_CLR_LSB, 8
#  -----------------------------------------------------------------------------
#  Field       : SIO_RISCV_SOFTIRQ_CORE1_SET
#  Description : Write 1 to atomically set the core 1 software interrupt flag.
#                Read to get the status of this flag.
.equ	SIO_RISCV_SOFTIRQ_CORE1_SET_RESET, 0x0
.equ	SIO_RISCV_SOFTIRQ_CORE1_SET_BITS, 0x00000002
.equ	SIO_RISCV_SOFTIRQ_CORE1_SET_MSB, 1
.equ	SIO_RISCV_SOFTIRQ_CORE1_SET_LSB, 1
#  -----------------------------------------------------------------------------
#  Field       : SIO_RISCV_SOFTIRQ_CORE0_SET
#  Description : Write 1 to atomically set the core 0 software interrupt flag.
#                Read to get the status of this flag.
.equ	SIO_RISCV_SOFTIRQ_CORE0_SET_RESET, 0x0
.equ	SIO_RISCV_SOFTIRQ_CORE0_SET_BITS, 0x00000001
.equ	SIO_RISCV_SOFTIRQ_CORE0_SET_MSB, 0
.equ	SIO_RISCV_SOFTIRQ_CORE0_SET_LSB, 0
#  =============================================================================
#  Register    : SIO_MTIME_CTRL
#  Description : Control register for the RISC-V 64-bit Machine-mode timer. This
#                timer is only present in the Secure SIO, so is only accessible
#                to an Arm core in Secure mode or a RISC-V core in Machine mode.
# 
#                Note whilst this timer follows the RISC-V privileged
#                specification, it is equally usable by the Arm cores. The
#                interrupts are routed to normal system-level interrupt lines as
#                well as to the MIP.MTIP inputs on the RISC-V cores.
.equ	SIO_MTIME_CTRL_OFFSET, 0x000001a4
.equ	SIO_MTIME_CTRL_BITS, 0x0000000f
.equ	SIO_MTIME_CTRL_RESET, 0x0000000d
#  -----------------------------------------------------------------------------
#  Field       : SIO_MTIME_CTRL_DBGPAUSE_CORE1
#  Description : If 1, the timer pauses when core 1 is in the debug halt state.
.equ	SIO_MTIME_CTRL_DBGPAUSE_CORE1_RESET, 0x1
.equ	SIO_MTIME_CTRL_DBGPAUSE_CORE1_BITS, 0x00000008
.equ	SIO_MTIME_CTRL_DBGPAUSE_CORE1_MSB, 3
.equ	SIO_MTIME_CTRL_DBGPAUSE_CORE1_LSB, 3
#  -----------------------------------------------------------------------------
#  Field       : SIO_MTIME_CTRL_DBGPAUSE_CORE0
#  Description : If 1, the timer pauses when core 0 is in the debug halt state.
.equ	SIO_MTIME_CTRL_DBGPAUSE_CORE0_RESET, 0x1
