konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/sio.inc
.equ	SIO_MTIME_CTRL_DBGPAUSE_CORE0_BITS, 0x00000004
.equ	SIO_MTIME_CTRL_DBGPAUSE_CORE0_MSB, 2
.equ	SIO_MTIME_CTRL_DBGPAUSE_CORE0_LSB, 2
#  -----------------------------------------------------------------------------
#  Field       : SIO_MTIME_CTRL_FULLSPEED
#  Description : If 1, increment the timer every cycle (i.e. run directly from
#                the system clock), rather than incrementing on the system-level
#                timer tick input.
.equ	SIO_MTIME_CTRL_FULLSPEED_RESET, 0x0
.equ	SIO_MTIME_CTRL_FULLSPEED_BITS, 0x00000002
.equ	SIO_MTIME_CTRL_FULLSPEED_MSB, 1
.equ	SIO_MTIME_CTRL_FULLSPEED_LSB, 1
#  -----------------------------------------------------------------------------
#  Field       : SIO_MTIME_CTRL_EN
#  Description : Timer enable bit. When 0, the timer will not increment
#                automatically.
.equ	SIO_MTIME_CTRL_EN_RESET, 0x1
.equ	SIO_MTIME_CTRL_EN_BITS, 0x00000001
.equ	SIO_MTIME_CTRL_EN_MSB, 0
.equ	SIO_MTIME_CTRL_EN_LSB, 0
#  =============================================================================
#  Register    : SIO_MTIME
#  Description : Read/write access to the high half of RISC-V Machine-mode
#                timer. This register is shared between both cores. If both
#                cores write on the same cycle, core 1 takes precedence.
.equ	SIO_MTIME_OFFSET, 0x000001b0
.equ	SIO_MTIME_BITS, 0xffffffff
.equ	SIO_MTIME_RESET, 0x00000000
.equ	SIO_MTIME_MSB, 31
.equ	SIO_MTIME_LSB, 0
#  =============================================================================
#  Register    : SIO_MTIMEH
#  Description : Read/write access to the high half of RISC-V Machine-mode
#                timer. This register is shared between both cores. If both
#                cores write on the same cycle, core 1 takes precedence.
.equ	SIO_MTIMEH_OFFSET, 0x000001b4
.equ	SIO_MTIMEH_BITS, 0xffffffff
.equ	SIO_MTIMEH_RESET, 0x00000000
.equ	SIO_MTIMEH_MSB, 31
.equ	SIO_MTIMEH_LSB, 0
#  =============================================================================
#  Register    : SIO_MTIMECMP
#  Description : Low half of RISC-V Machine-mode timer comparator. This register
#                is core-local, i.e., each core gets a copy of this register,
#                with the comparison result routed to its own interrupt line.
# 
#                The timer interrupt is asserted whenever MTIME is greater than
#                or equal to MTIMECMP. This comparison is unsigned, and
#                performed on the full 64-bit values.
.equ	SIO_MTIMECMP_OFFSET, 0x000001b8
.equ	SIO_MTIMECMP_BITS, 0xffffffff
.equ	SIO_MTIMECMP_RESET, 0xffffffff
.equ	SIO_MTIMECMP_MSB, 31
.equ	SIO_MTIMECMP_LSB, 0
#  =============================================================================
#  Register    : SIO_MTIMECMPH
#  Description : High half of RISC-V Machine-mode timer comparator. This
#                register is core-local.
# 
#                The timer interrupt is asserted whenever MTIME is greater than
#                or equal to MTIMECMP. This comparison is unsigned, and
#                performed on the full 64-bit values.
.equ	SIO_MTIMECMPH_OFFSET, 0x000001bc
.equ	SIO_MTIMECMPH_BITS, 0xffffffff
.equ	SIO_MTIMECMPH_RESET, 0xffffffff
.equ	SIO_MTIMECMPH_MSB, 31
.equ	SIO_MTIMECMPH_LSB, 0
#  =============================================================================
#  Register    : SIO_TMDS_CTRL
#  Description : Control register for TMDS encoder.
.equ	SIO_TMDS_CTRL_OFFSET, 0x000001c0
.equ	SIO_TMDS_CTRL_BITS, 0x1f9fffff
.equ	SIO_TMDS_CTRL_RESET, 0x00000000
#  -----------------------------------------------------------------------------
#  Field       : SIO_TMDS_CTRL_CLEAR_BALANCE
#  Description : Clear the running DC balance state of the TMDS encoders. This
#                bit should be written once at the beginning of each scanline.
.equ	SIO_TMDS_CTRL_CLEAR_BALANCE_RESET, 0x0
.equ	SIO_TMDS_CTRL_CLEAR_BALANCE_BITS, 0x10000000
.equ	SIO_TMDS_CTRL_CLEAR_BALANCE_MSB, 28
.equ	SIO_TMDS_CTRL_CLEAR_BALANCE_LSB, 28
#  -----------------------------------------------------------------------------
#  Field       : SIO_TMDS_CTRL_PIX2_NOSHIFT
#  Description : When encoding two pixels's worth of symbols in one cycle (a
#                read of a PEEK/POP_DOUBLE register), the second encoder sees a
#                shifted version of the colour data register.
# 
#                This control disables that shift, so that both encoder layers
#                see the same pixel data. This is used for pixel doubling.
.equ	SIO_TMDS_CTRL_PIX2_NOSHIFT_RESET, 0x0
.equ	SIO_TMDS_CTRL_PIX2_NOSHIFT_BITS, 0x08000000
.equ	SIO_TMDS_CTRL_PIX2_NOSHIFT_MSB, 27
.equ	SIO_TMDS_CTRL_PIX2_NOSHIFT_LSB, 27
#  -----------------------------------------------------------------------------
#  Field       : SIO_TMDS_CTRL_PIX_SHIFT
#  Description : Shift applied to the colour data register with each read of a
#                POP alias register.
# 
#                Reading from the POP_SINGLE register, or reading from the
#                POP_DOUBLE register with PIX2_NOSHIFT set (for pixel doubling),
#                shifts by the indicated amount.
# 
#                Reading from a POP_DOUBLE register when PIX2_NOSHIFT is clear
#                will shift by double the indicated amount. (Shift by 32 means
#                no shift.)
#                0x0 -> Do not shift the colour data register.
#                0x1 -> Shift the colour data register by 1 bit
#                0x2 -> Shift the colour data register by 2 bits
#                0x3 -> Shift the colour data register by 4 bits
#                0x4 -> Shift the colour data register by 8 bits
#                0x5 -> Shift the colour data register by 16 bits
.equ	SIO_TMDS_CTRL_PIX_SHIFT_RESET, 0x0
.equ	SIO_TMDS_CTRL_PIX_SHIFT_BITS, 0x07000000
.equ	SIO_TMDS_CTRL_PIX_SHIFT_MSB, 26
.equ	SIO_TMDS_CTRL_PIX_SHIFT_LSB, 24
.equ	SIO_TMDS_CTRL_PIX_SHIFT_VALUE_0, 0x0
.equ	SIO_TMDS_CTRL_PIX_SHIFT_VALUE_1, 0x1
.equ	SIO_TMDS_CTRL_PIX_SHIFT_VALUE_2, 0x2
.equ	SIO_TMDS_CTRL_PIX_SHIFT_VALUE_4, 0x3
.equ	SIO_TMDS_CTRL_PIX_SHIFT_VALUE_8, 0x4
.equ	SIO_TMDS_CTRL_PIX_SHIFT_VALUE_16, 0x5
#  -----------------------------------------------------------------------------
#  Field       : SIO_TMDS_CTRL_INTERLEAVE
#  Description : Enable lane interleaving for reads of PEEK_SINGLE/POP_SINGLE.
# 
#                When interleaving is disabled, each of the 3 symbols appears as
#                a contiguous 10-bit field, with lane 0 being the least-
#                significant and starting at bit 0 of the register.
# 
#                When interleaving is enabled, the symbols are packed into 5
#                chunks of 3 lanes times 2 bits (30 bits total). Each chunk
#                contains two bits of a TMDS symbol per lane, with lane 0 being
#                the least significant.
.equ	SIO_TMDS_CTRL_INTERLEAVE_RESET, 0x0
.equ	SIO_TMDS_CTRL_INTERLEAVE_BITS, 0x00800000
.equ	SIO_TMDS_CTRL_INTERLEAVE_MSB, 23
.equ	SIO_TMDS_CTRL_INTERLEAVE_LSB, 23
#  -----------------------------------------------------------------------------
#  Field       : SIO_TMDS_CTRL_L2_NBITS
#  Description : Number of valid colour MSBs for lane 2 (1-8 bits, encoded as 0
#                through 7). Remaining LSBs are masked to 0 after the rotate.
.equ	SIO_TMDS_CTRL_L2_NBITS_RESET, 0x0
.equ	SIO_TMDS_CTRL_L2_NBITS_BITS, 0x001c0000
.equ	SIO_TMDS_CTRL_L2_NBITS_MSB, 20
.equ	SIO_TMDS_CTRL_L2_NBITS_LSB, 18
#  -----------------------------------------------------------------------------
#  Field       : SIO_TMDS_CTRL_L1_NBITS
#  Description : Number of valid colour MSBs for lane 1 (1-8 bits, encoded as 0
#                through 7). Remaining LSBs are masked to 0 after the rotate.
.equ	SIO_TMDS_CTRL_L1_NBITS_RESET, 0x0
.equ	SIO_TMDS_CTRL_L1_NBITS_BITS, 0x00038000
.equ	SIO_TMDS_CTRL_L1_NBITS_MSB, 17
.equ	SIO_TMDS_CTRL_L1_NBITS_LSB, 15
#  -----------------------------------------------------------------------------
#  Field       : SIO_TMDS_CTRL_L0_NBITS
#  Description : Number of valid colour MSBs for lane 0 (1-8 bits, encoded as 0
#                through 7). Remaining LSBs are masked to 0 after the rotate.
.equ	SIO_TMDS_CTRL_L0_NBITS_RESET, 0x0
.equ	SIO_TMDS_CTRL_L0_NBITS_BITS, 0x00007000
.equ	SIO_TMDS_CTRL_L0_NBITS_MSB, 14
.equ	SIO_TMDS_CTRL_L0_NBITS_LSB, 12
#  -----------------------------------------------------------------------------
#  Field       : SIO_TMDS_CTRL_L2_ROT
#  Description : Right-rotate the 16 LSBs of the colour accumulator by 0-15
#                bits, in order to get the MSB of the lane 2 (red) colour data
#                aligned with the MSB of the 8-bit encoder input.
# 
#                For example, for RGB565 (red most significant), red is bits
#                15:11, so should be right-rotated by 8 bits to align with bits
#                7:3 of the encoder input.
.equ	SIO_TMDS_CTRL_L2_ROT_RESET, 0x0
.equ	SIO_TMDS_CTRL_L2_ROT_BITS, 0x00000f00
.equ	SIO_TMDS_CTRL_L2_ROT_MSB, 11
.equ	SIO_TMDS_CTRL_L2_ROT_LSB, 8
#  -----------------------------------------------------------------------------
#  Field       : SIO_TMDS_CTRL_L1_ROT
#  Description : Right-rotate the 16 LSBs of the colour accumulator by 0-15
#                bits, in order to get the MSB of the lane 1 (green) colour data
#                aligned with the MSB of the 8-bit encoder input.
# 
#                For example, for RGB565, green is bits 10:5, so should be
#                right-rotated by 3 bits to align with bits 7:2 of the encoder
#                input.
.equ	SIO_TMDS_CTRL_L1_ROT_RESET, 0x0
.equ	SIO_TMDS_CTRL_L1_ROT_BITS, 0x000000f0
.equ	SIO_TMDS_CTRL_L1_ROT_MSB, 7
.equ	SIO_TMDS_CTRL_L1_ROT_LSB, 4
#  -----------------------------------------------------------------------------
#  Field       : SIO_TMDS_CTRL_L0_ROT
#  Description : Right-rotate the 16 LSBs of the colour accumulator by 0-15
#                bits, in order to get the MSB of the lane 0 (blue) colour data
#                aligned with the MSB of the 8-bit encoder input.
# 
#                For example, for RGB565 (red most significant), blue is bits
#                4:0, so should be right-rotated by 13 to align with bits 7:3 of
#                the encoder input.
.equ	SIO_TMDS_CTRL_L0_ROT_RESET, 0x0
.equ	SIO_TMDS_CTRL_L0_ROT_BITS, 0x0000000f
.equ	SIO_TMDS_CTRL_L0_ROT_MSB, 3
.equ	SIO_TMDS_CTRL_L0_ROT_LSB, 0
#  =============================================================================
#  Register    : SIO_TMDS_WDATA
#  Description : Write-only access to the TMDS colour data register.
.equ	SIO_TMDS_WDATA_OFFSET, 0x000001c4
.equ	SIO_TMDS_WDATA_BITS, 0xffffffff
.equ	SIO_TMDS_WDATA_RESET, 0x00000000
.equ	SIO_TMDS_WDATA_MSB, 31
.equ	SIO_TMDS_WDATA_LSB, 0
#  =============================================================================
#  Register    : SIO_TMDS_PEEK_SINGLE
#  Description : Get the encoding of one pixel's worth of colour data, packed
#                into a 32-bit value (3x10-bit symbols).
# 
#                The PEEK alias does not shift the colour register when read,
#                but still advances the running DC balance state of each
#                encoder. This is useful for pixel doubling.
.equ	SIO_TMDS_PEEK_SINGLE_OFFSET, 0x000001c8
.equ	SIO_TMDS_PEEK_SINGLE_BITS, 0xffffffff
.equ	SIO_TMDS_PEEK_SINGLE_RESET, 0x00000000
.equ	SIO_TMDS_PEEK_SINGLE_MSB, 31
.equ	SIO_TMDS_PEEK_SINGLE_LSB, 0
#  =============================================================================
#  Register    : SIO_TMDS_POP_SINGLE
#  Description : Get the encoding of one pixel's worth of colour data, packed
#                into a 32-bit value. The packing is 5 chunks of 3 lanes times 2
#                bits (30 bits total). Each chunk contains two bits of a TMDS
#                symbol per lane. This format is intended for shifting out with
#                the HSTX peripheral on RP2350.
# 
#                The POP alias shifts the colour register when read, as well as
#                advancing the running DC balance state of each encoder.
.equ	SIO_TMDS_POP_SINGLE_OFFSET, 0x000001cc
.equ	SIO_TMDS_POP_SINGLE_BITS, 0xffffffff
.equ	SIO_TMDS_POP_SINGLE_RESET, 0x00000000
.equ	SIO_TMDS_POP_SINGLE_MSB, 31
.equ	SIO_TMDS_POP_SINGLE_LSB, 0
#  =============================================================================
#  Register    : SIO_TMDS_PEEK_DOUBLE_L0
#  Description : Get lane 0 of the encoding of two pixels' worth of colour data.
#                Two 10-bit TMDS symbols are packed at the bottom of a 32-bit
#                word.
# 
#                The PEEK alias does not shift the colour register when read,
#                but still advances the lane 0 DC balance state. This is useful
#                if all 3 lanes' worth of encode are to be read at once, rather
#                than processing the entire scanline for one lane before moving
#                to the next lane.
.equ	SIO_TMDS_PEEK_DOUBLE_L0_OFFSET, 0x000001d0
.equ	SIO_TMDS_PEEK_DOUBLE_L0_BITS, 0xffffffff
.equ	SIO_TMDS_PEEK_DOUBLE_L0_RESET, 0x00000000
.equ	SIO_TMDS_PEEK_DOUBLE_L0_MSB, 31
.equ	SIO_TMDS_PEEK_DOUBLE_L0_LSB, 0
#  =============================================================================
#  Register    : SIO_TMDS_POP_DOUBLE_L0
#  Description : Get lane 0 of the encoding of two pixels' worth of colour data.
#                Two 10-bit TMDS symbols are packed at the bottom of a 32-bit
#                word.
# 
#                The POP alias shifts the colour register when read, according
#                to the values of PIX_SHIFT and PIX2_NOSHIFT.
.equ	SIO_TMDS_POP_DOUBLE_L0_OFFSET, 0x000001d4
.equ	SIO_TMDS_POP_DOUBLE_L0_BITS, 0xffffffff
.equ	SIO_TMDS_POP_DOUBLE_L0_RESET, 0x00000000
.equ	SIO_TMDS_POP_DOUBLE_L0_MSB, 31
.equ	SIO_TMDS_POP_DOUBLE_L0_LSB, 0
#  =============================================================================
#  Register    : SIO_TMDS_PEEK_DOUBLE_L1
#  Description : Get lane 1 of the encoding of two pixels' worth of colour data.
#                Two 10-bit TMDS symbols are packed at the bottom of a 32-bit
#                word.
# 
#                The PEEK alias does not shift the colour register when read,
#                but still advances the lane 1 DC balance state. This is useful
#                if all 3 lanes' worth of encode are to be read at once, rather
#                than processing the entire scanline for one lane before moving
#                to the next lane.
.equ	SIO_TMDS_PEEK_DOUBLE_L1_OFFSET, 0x000001d8
.equ	SIO_TMDS_PEEK_DOUBLE_L1_BITS, 0xffffffff
.equ	SIO_TMDS_PEEK_DOUBLE_L1_RESET, 0x00000000
.equ	SIO_TMDS_PEEK_DOUBLE_L1_MSB, 31
.equ	SIO_TMDS_PEEK_DOUBLE_L1_LSB, 0
#  =============================================================================
#  Register    : SIO_TMDS_POP_DOUBLE_L1
#  Description : Get lane 1 of the encoding of two pixels' worth of colour data.
#                Two 10-bit TMDS symbols are packed at the bottom of a 32-bit
#                word.
# 
#                The POP alias shifts the colour register when read, according
#                to the values of PIX_SHIFT and PIX2_NOSHIFT.
.equ	SIO_TMDS_POP_DOUBLE_L1_OFFSET, 0x000001dc
.equ	SIO_TMDS_POP_DOUBLE_L1_BITS, 0xffffffff
.equ	SIO_TMDS_POP_DOUBLE_L1_RESET, 0x00000000
.equ	SIO_TMDS_POP_DOUBLE_L1_MSB, 31
.equ	SIO_TMDS_POP_DOUBLE_L1_LSB, 0
#  =============================================================================
#  Register    : SIO_TMDS_PEEK_DOUBLE_L2
#  Description : Get lane 2 of the encoding of two pixels' worth of colour data.
#                Two 10-bit TMDS symbols are packed at the bottom of a 32-bit
#                word.
# 
#                The PEEK alias does not shift the colour register when read,
#                but still advances the lane 2 DC balance state. This is useful
#                if all 3 lanes' worth of encode are to be read at once, rather
#                than processing the entire scanline for one lane before moving
#                to the next lane.
.equ	SIO_TMDS_PEEK_DOUBLE_L2_OFFSET, 0x000001e0
.equ	SIO_TMDS_PEEK_DOUBLE_L2_BITS, 0xffffffff
.equ	SIO_TMDS_PEEK_DOUBLE_L2_RESET, 0x00000000
.equ	SIO_TMDS_PEEK_DOUBLE_L2_MSB, 31
.equ	SIO_TMDS_PEEK_DOUBLE_L2_LSB, 0
#  =============================================================================
#  Register    : SIO_TMDS_POP_DOUBLE_L2
#  Description : Get lane 2 of the encoding of two pixels' worth of colour data.
#                Two 10-bit TMDS symbols are packed at the bottom of a 32-bit
#                word.
# 
#                The POP alias shifts the colour register when read, according
#                to the values of PIX_SHIFT and PIX2_NOSHIFT.
.equ	SIO_TMDS_POP_DOUBLE_L2_OFFSET, 0x000001e4
.equ	SIO_TMDS_POP_DOUBLE_L2_BITS, 0xffffffff
.equ	SIO_TMDS_POP_DOUBLE_L2_RESET, 0x00000000
.equ	SIO_TMDS_POP_DOUBLE_L2_MSB, 31
.equ	SIO_TMDS_POP_DOUBLE_L2_LSB, 0
#  =============================================================================
.endif # _HARDWARE_REGS_SIO_H
